[
  {
    "joke": "Chuck Norris can change the font of a dot."
  },
  {
    "joke": "According to an assay report filed with the Texas Dept of Minerals & Land Mgt, Chuck Norris' front yard is comprised of 37.8% silver ore, 14.7% iron ore, 12.2% gold, 11% other tangent minerals & 24.3% fragmented skulls."
  },
  {
    "joke": "Chuck Norris has a bigger dick than shaq"
  },
  {
    "joke": "Chuck Norris doesn't defy gravity. He simply kicks it in the nuts."
  },
  {
    "joke": "Michele Bachmann's face needed pastic surgery again after she called Chuck Norris' mother a social succubus for recieving social security payments that her husband & she paid into for 50 years."
  },
  {
    "joke": "The original title for Clash of The Titans was Clash of The Titans with Chuck Norris. The film was cancelled shortly after going into preproduction. No one would pay nine dollars to see a movie ten seconds long."
  },
  {
    "joke": "Chuck Norris takes Viagra to LOSE an erection."
  },
  {
    "joke": "\"The Bride of Chucky\" might be a scary movie. But \"The Beard of Chuck\" is even scarier... Chuck Norris FTW......"
  },
  {
    "joke": "Mother Teresa said Chuck Norris was the only man she ever wanted to marry."
  },
  {
    "joke": "Chuck Norris doesn't get crabs... he gets lobsters"
  },
  {
    "joke": "No one has ever spoken during review of Chuck Norris' code and lived to tell about it."
  },
  {
    "joke": "Chuck Norris doesn't pedal a bike. He roundhouse-kicks one of the pedals to go a mile."
  },
  {
    "joke": "Godzilla is a Japanese rendition of Chuck Norris' first visit to Tokyo."
  },
  {
    "joke": "A strange-but-true phenomenon - whenever there is a natural disaster in the world, Chuck Norris' stocks soar."
  },
  {
    "joke": "When Chuck Norris says \"pull my finger\", plan on being cloaked in and smothered to death in brown vapor."
  },
  {
    "joke": "Oxygen requires Chuck Norris to live"
  },
  {
    "joke": "Chuck Norris was on one part on Titanic.... He was the iceberg!"
  },
  {
    "joke": "After he was born, Chuck Norris immediately ate his own placenta."
  },
  {
    "joke": "Chuck Norris can snipe you with a spitball"
  },
  {
    "joke": "When he wants to, Chuck Norris can literally shit nickels. This comes in handy when he's playing the slots in Vegas"
  },
  {
    "joke": "Contrary to popular belief, Chuck Norris, not the box jellyfish of northern Australia, is the most venomous creature on earth. Within 3 minutes of being bitten, a human being experiences the following symptoms: fever, blurred vision, beard rash, tightness of the jeans, and the feeling of being repeatedly kicked through a car windshield."
  },
  {
    "joke": "Parties at the home of Chuck Norris make the ones at the Playboy Mansion seem like senior citizen afternoon teas by comparison."
  },
  {
    "joke": "Chuck Norris' speed while running reaches close to the speed of light. His speed while walking is twice the speed of sound. His speed while sleeping is 495 mph."
  },
  {
    "joke": "When Chuck Norris is in a crowded area, he doesn't walk around people. He walks through them."
  },
  {
    "joke": "When Chuck Norris swims with sharks, it is the sharks that wear chain-mail suits."
  },
  {
    "joke": "The Rolling Stones found out the hard way Chuck Norris CAN always get what you want."
  },
  {
    "joke": "Due to his jet-setting lifestyle, Chuck Norris knows how to say 'Time to die' in over thirty different languages."
  },
  {
    "joke": "Texas Tea - Chuck Norris sweat"
  },
  {
    "joke": "Chuck Norris' Doctor does physicals and normally says \"turn your head and cough\". When Chuck drops his pants the Doctor says \"oh my god\"!!"
  },
  {
    "joke": "a long time ago Chuck Norris kicked the world so hard that its still spinning today."
  },
  {
    "joke": "Super Man's nacked eye can withstand a bullet. Chuck Norris' middle finger can reflect a laser beam and kill the shooter between the eyes."
  },
  {
    "joke": "Cocaine is really just Chuck Norris's dandruff"
  },
  {
    "joke": "CHUCK NORRIS ONCE IMPALED A MAN WITH A SINGLE PUBE"
  },
  {
    "joke": "The Dream lives Chuck Norris."
  },
  {
    "joke": "When The Four Horseman of the Apocalypse entered this world, the first person they met was Chuck Norris. They now bunk at his horse ranch in Texas and clean the manure from the stables every morning."
  },
  {
    "joke": "Chuck Norris once tried to wear glasses, the result was him seing his back."
  },
  {
    "joke": "Project Mayhem was inspired by a neighborhood club Chuck Norris formed as a child."
  },
  {
    "joke": "When Chuck Norris plays football, he uses his foot and your balls."
  },
  {
    "joke": "Love is a battlefield. Chuck Norris is Field Marshall."
  },
  {
    "joke": "Chuck Norris doesn't use GUI, he prefers COMMAND line."
  },
  {
    "joke": "Chuck Norris is so hard that he mows the lawn with his teeth."
  },
  {
    "joke": "Jesus walked on water. Chuck Norris swam on land"
  },
  {
    "joke": "Chuck Norris can kill you with a headshot using a shotgun from across the map on call of duty."
  },
  {
    "joke": "If a vampire bites Chuck Norris, it becomes his slave."
  },
  {
    "joke": "Chuck Norris once roasted an entire moose on the manifold of his Hummer."
  },
  {
    "joke": "Chuck Norris created ninjas."
  },
  {
    "joke": "Chuck Norris is always ahead of everybody else. But during Daylight Savings Time he is 2 hours ahead."
  },
  {
    "joke": "Chuck Norris was asked if he had ever gone skindiving? Chuck replied \"no, but I've gone muff diving hundreds of times\"."
  },
  {
    "joke": "The moment were you dont capitalize CHUCK NORRIS is the moment when Chuck Norris decides that your dieing at that very moment.... But this is only possible if you havent pissed CHUCK NORRIS off already... Because you would already be dead."
  },
  {
    "joke": "Chuck Norris can break your neck with his tongue, tear your heart out with his eyelashes and kick you in the dick with enough force to leave a mushroom-shaped hole in the brick wall behind you."
  },
  {
    "joke": "The sun moves across the sky because its running from Chuck Norris."
  },
  {
    "joke": "Chuck Norris turned down the role as Optimus Prime!"
  },
  {
    "joke": "For every foot that comes packed with force, fear, pain and suffering, that foot is connected to a leg, and that leg, with muscles like steel, is bound forever strong to a creature known as Chuck Norris."
  },
  {
    "joke": "If Chuck Norris imagines roundhouse kicking someone, that roundhouse kick actually hurts someone. Try not to imagine him imagining that."
  },
  {
    "joke": "If you stare at a picture of Chuck Norris long enough, your jaw will start hurting."
  },
  {
    "joke": "Chuck Norris invented the word 'oblivion' so his roundhouse victums would have a place to find themselves kicked into."
  },
  {
    "joke": "Whenever Chuck Norris sees a world touched by war, thousands of soldiers dying and mortars exploding, guns guns and more guns are firing....He really just wants to nuke the crap outta it."
  },
  {
    "joke": "Chuck Norris can parallel park a tank."
  },
  {
    "joke": "Chuck Norris brung MJ back to life, but screwed up and made Taylor Swift."
  },
  {
    "joke": "Chuck Norris can cremate you instantly with a mean-ass death stare."
  },
  {
    "joke": "Chuck Norris sack-slapped a man in Reno just to watch him cry."
  },
  {
    "joke": "chuck Norris doesnt play russian rulet with a revolver... he plays with a .50cal desert eagle"
  },
  {
    "joke": "When Chuck Norris plays pokemon red, his starter pokemon choices are: Darkrai, Arceus, and Missingno. He, of course, takes them all and is ALREADY a pokemon champion."
  },
  {
    "joke": "Peter Piper picked a peck of pickled peppers. Chuck Norris shot him and screwed his mother against a wall for three hours."
  },
  {
    "joke": "Every morning, Chuck Norris gets up and splashes boiling oil in his face to wake him up."
  },
  {
    "joke": "When someone names a list of people, it goes like this: Mary, James, Shawn... etc, Chuck Norris. Chuck Norris always comes after etc, since no one comes after Chuck Norris."
  },
  {
    "joke": "The Most Interesting Man in the World's hair is not actually grey. It's actually covered with Chuck Norris' sperm."
  },
  {
    "joke": "The US army gave Osama Bin Laden's head to Chuck Norris. It now adorns the hood of his Hummer, which can be seen cruising through the streets of Abbotabad, Pakistan, with the song 'We Are The Champions' blaring from its speakers."
  },
  {
    "joke": "Christians believe Jesus was crucified, died, and rose on the third day. Chuck Norris cannot die."
  },
  {
    "joke": "Chuck Norris uses an F5 tornado to mop the blood off his palace floors."
  },
  {
    "joke": "Fool me once: shame on you. Fool Chuck Norris once: actually, you can't ever fool Chuck, and he'll kill you for even thinking about it."
  },
  {
    "joke": "Chuck Norris walked past Uasin Bolt who was running the 100m... on the day that he broke the world record"
  },
  {
    "joke": "Burger King once tried to sue Chuck Norris for copy write infringment because he has a sign on his front gate that says \"Home of the Whopper\". They lost"
  },
  {
    "joke": "Chuck Norris is a supporter of gender equality in the workplace. That's why he makes his female employees work longer hours so they can earn the same as the men."
  },
  {
    "joke": "Long time ago Chuck Norris sneeze. That's how created the Big Bang."
  },
  {
    "joke": "Chuck Norris can call himself on his own cell phone and not get a busy signal."
  },
  {
    "joke": "Gordon Ramsay features Chuck Norris' Toaster Strudel recipe in all of his restaurants."
  },
  {
    "joke": "In 2014 Chuck Norris will launch his own fragrance, Dojo Mojo, which smells of denim and justice."
  },
  {
    "joke": "A Chuck Norris stare can literally burn holes through you."
  },
  {
    "joke": "Chuck norris scares leftovers into being fresh with one bite"
  },
  {
    "joke": "Every year on his birthday, Chuck norris randomly selects one lucky child to be thrown into the sun."
  },
  {
    "joke": "Chuck Norris kills only on days that end with \"y\""
  },
  {
    "joke": "Chuck Norris doesn't use a phone to communicate his messages to a distant person, he just shouts it over."
  },
  {
    "joke": "Chuck Norris can play Xbox Kinect games on his PlayStation4 and PlayStation Move games on his Xbox 720."
  },
  {
    "joke": "The Dos Equis guy was cloned from a piece of Chuck Norris's ass"
  },
  {
    "joke": "How many Chuck Norris' roundhouse kick does it take for a nuclear explosion?  2"
  },
  {
    "joke": "\"Bigfoot\" did exist...until he tried to threaten Chuck Norris."
  },
  {
    "joke": "Daenerys Targaryen is the \"Khaleesi of the Great Grass Sea,\" the \"Breaker of Chains,\" and \"Mother of Dragons.\"  She would trade all that and more to become \"Woman of Chuck Norris.\""
  },
  {
    "joke": "Chuck Norris' Doctor does physicals and normally says \"turn your head and cough\". When Chuck drops his pants the Doctor says \"oh my god\"!!"
  },
  {
    "joke": "You know how they say if you die in your dream then you will die in real life? In actuality, if you dream of death then Chuck Norris will find you and kill you."
  },
  {
    "joke": "Chuck Norris lives in the guest house at his Texas palatial estate. Only his main house mansion is spacious enough to store all of his guns, ammo and ninja death stars."
  },
  {
    "joke": "Ice has Chuck Norris running through its veins"
  },
  {
    "joke": "Just before killing someone, Chuck Norris likes to say 'where's your god now?'"
  },
  {
    "joke": "Chuck Norris was hiking and came face to face with Sasquatch. There was IMMEDIATE PANIC, then the Sasquatch was seen running screaming into the woods."
  },
  {
    "joke": "Chuck Norris does not hunt because the word hunting infers the probability of failure. Chuck Norris goes killing"
  },
  {
    "joke": "Chuck Norris can drown water"
  },
  {
    "joke": "Chuck Norris was actually the one who made the world, he was just modest and let god take the credit."
  },
  {
    "joke": "Chuck Norris beat Halo 1 2 and 3 on legendary with a broken guitar hero controller"
  },
  {
    "joke": "Chuck Norris' fairy godparents do not use \"Da Rules book\". He can wish for anything he wants no matter if its bad or not."
  },
  {
    "joke": "Chuck Norris named his price and saved 15% or more on car insurance when he switched to Allstate."
  },
  {
    "joke": "When Chuck Norris is driving traffic lights never turn red"
  },
  {
    "joke": "Chuck Norris can win German Soccer Championship ...... with Schalke 04"
  },
  {
    "joke": "In the sport of bull riding staying on for 8 seconds is success. In Texas there is a sport called Chuck Norris riding. To date no bull has been able to stay on Chuck Norris for more then 3 seconds."
  },
  {
    "joke": "Chuck Norris's version of a \"chocolate milkshake\" is a raw porterhouse wrapped around ten Hershey bars, and doused in diesel fuel."
  },
  {
    "joke": "Every Thanksgiving, millions of people are thankful that Chuck Norris has allowed them to continue to live."
  },
  {
    "joke": "Never say that your life is hard... Chuck Norris wakes up with a dick harder than your pathetic life"
  },
  {
    "joke": "Orange rhymes with Chuck Norris"
  },
  {
    "joke": "Chuck Norris trained his pet mountain lions to nurse baby sheep and later fed them back to the mountain lions thus perpetuating mountain lion existence."
  },
  {
    "joke": "Chuck Norris once downloaded the entire Internet"
  },
  {
    "joke": "Chuck Norris invented the iPad by crushing the skull of a Borg."
  },
  {
    "joke": "How come so many Godzilla movies were made? Because they never hired Chuck Norris to kill him off once and for all."
  },
  {
    "joke": "Death once visited Chuck Norris,CHuck Norris said\"DON'T EVER TELL CHUCK NORRIS WHEN HE DIES,I TELL YOU WHEN YOU DIE.\"Then Chuck delievered the most powerful roundhouse kick ever and even Death knew he did something wrong as he declined into hell."
  },
  {
    "joke": "Life finds a way... of being ended by Chuck Norris"
  },
  {
    "joke": "Chuck Norris can clap using one hand."
  },
  {
    "joke": "The pen is mighter than the sword, but only if the pen is held by Chuck Norris."
  },
  {
    "joke": "\"Doom\" -- 1) a popular video game. 2) Your inevitable fate if you fight Chuck Norris."
  },
  {
    "joke": "Chuck Norris's spit is the cure(they dont want you to know) for the swine flu"
  },
  {
    "joke": "Chuck Norris goes bob-sledding in a coffin. It's the only time he can get some private time on the snow fields to have his threesomes."
  },
  {
    "joke": "If you are female, and you are reading this, Chuck Norris just fucked you and erased your memory when you read the word 'fucked'. And again, just then. Fuck, sorry."
  },
  {
    "joke": "Mick Jagger: \"oh you can't always get what you waaaannt.\"  Chuck Norris \"Yes I can.\""
  },
  {
    "joke": "If Chuck Norris had killed Kenny, he would have stayed dead."
  },
  {
    "joke": "Chuck Norris actually smiles two or three times a year, proving that his facial muscles can withstand stresses which would pulp a regular human skull."
  },
  {
    "joke": "Chuck Norris is the reason Osama Bin Laden is hiding"
  },
  {
    "joke": "Chuck Norris can do a roundhouse kick faster than the speed of light. This means that if you turn on a light switch, you will be dead before the lightbulb turns on."
  },
  {
    "joke": "Bigfoot has plaster casts of Chuck Norris' foot prints."
  },
  {
    "joke": "Nothing can escape the gravity of a black hole, except for Chuck Norris. Chuck Norris eats black holes. They taste like chicken."
  },
  {
    "joke": "The great wall of china was made as a stand for Chuck Norris's penis as Chuck Norris couldn't hold it up him self. Just kidding, he just wasn't bothered. And he HAS been alive that long."
  },
  {
    "joke": "Disco, the Latin language, and Dinosaurs: all unfortunate victims of Chuck Norris."
  },
  {
    "joke": "Chuck Norris likes cigarettes on his sandvich."
  },
  {
    "joke": "The name 'Chuck Norris' rolls off the tongue and kicks you in the face."
  },
  {
    "joke": "Chuck Norris got tired of hearing about the internet phenomenon about him. So he recently invented the Chuckroll."
  },
  {
    "joke": "Chuck Norris believes in lethal injection. He just shoves his index finger through your skull."
  },
  {
    "joke": "Chuck Norris once had a running race with a tortoise. In the middle of the race, Chuck Norris decided to take a nap. The tortoise managed to cover the distance and win the race while Chuck Norris was sleeping.  On realizing he had won the race, the shocked and fear-stricken tortoise ran and hid in the depths of the Pacific ocean.   Long story short, Chuck Norris has the shell of that tortoise hung on the wall of his house as a message to everyone that \"No one wins Chuck Norris, no matter what\"."
  },
  {
    "joke": "In space, no one can hear you scream..... apart from Chuck Norris. He hears everything!"
  },
  {
    "joke": "Chuck Norris will not be in The Expendables 3 simply because Stallone never wants to feel that terrified again."
  },
  {
    "joke": "In 1644 Chuck Norris killed 1000 knights in a jousting match, not with a lance, but with his penis."
  },
  {
    "joke": "when Chuck Norris eats his face his face comes out of his face which then comes out of his face and them he says where's my face do you guys know? nobody knows Chuck Norris' real face! hey wait a minute wheres my face...?"
  },
  {
    "joke": "The original Linux kernel was written in Persian by Chuck Norris. Linus Torvalds ported it to C."
  },
  {
    "joke": "Chuck Norris once extinguished a veld fire using just a flamethrower, only Chuck Norris can fight fire with fire."
  },
  {
    "joke": "Chuck Norris has killed dozens of men by slapping them across the face with his penis."
  },
  {
    "joke": "Chuck Norris laughs at Tiger Woods' pathetic attempts to get to his level."
  },
  {
    "joke": "When life throws lemons at chuck Norris, he catches them and throws them back at life."
  },
  {
    "joke": "Switzerland guarantees its neutrality by paying Chuck Norris a tribute of 10 million dollars and 52 hot women each year."
  },
  {
    "joke": "As a youngster, just for kicks Chuck Norris would often tie up a neighborhood kid and tell him he'd be back in 30 minutes to kick his @$$. That man grew up to be Harry Houdini."
  },
  {
    "joke": "Chuck Norris taught a young Tiger Woods everything about golf in a single lesson. Unfortunatly, Woods also caught a dose of Norris' enormous sex drive."
  },
  {
    "joke": "Chuck Norris' passport is his face."
  },
  {
    "joke": "Chuck Norris can scramble eggs with your face. Then unscramble them with his chest hair. Then fry them overeasy after flattening your hands by slamming his testicles on them. And then use your hands as a spatula to flip the eggs."
  },
  {
    "joke": "Chuck Norris does not sleep. He waits."
  },
  {
    "joke": "Chuck Norris opens beer bottles with the nearest person's anus."
  },
  {
    "joke": "Chuck Norris visits an active volcano every morning to get some of \"the best damn espresso on Earth\"."
  },
  {
    "joke": "Adamantium isn't nearly as hard as Chuck Norris."
  },
  {
    "joke": "Chuck Norris only smokes Havana cigars and the cigars are personaly delived to Chuck Norris by Castro."
  },
  {
    "joke": "Most people fear the Reaper. Chuck Norris considers him \"a promising Rookie\"."
  },
  {
    "joke": "Chuck Norris busted Phineas and Ferb"
  },
  {
    "joke": "Chuck Norris doesn't walk - the world just rolls beneath his feet."
  },
  {
    "joke": "Christiano Ronaldo is only good at soccer for one reason.Chuck Norris taught him how to roundhouse the ball."
  },
  {
    "joke": "Chuck Norris knows the last digit of PI."
  },
  {
    "joke": "Chuck Norris entered the dragon from behind"
  },
  {
    "joke": "In a fight between Batman and Darth Vader, the winner would be Chuck Norris."
  },
  {
    "joke": "Chuck Norris was stranded on an island and survived by eating fish hooks. Chuck told his rescuer \"they weren't very tasty but they filled me up\"."
  },
  {
    "joke": "Chuck Norris attacks sharks when he's smells them bleed"
  },
  {
    "joke": "Chuck Norris framed Michael Jackson's doctor."
  },
  {
    "joke": "Chuck Norris finished the ice bucket challenge by dumping the entire Antarctica continent on his head."
  },
  {
    "joke": "The last time Chuck Norris farted, Steven Seagal was born"
  },
  {
    "joke": "Q. Why did Chuck Norris cross the road? A. He had his dick stuck in a chicken's ass."
  },
  {
    "joke": "Chuck Norris' breath always smells like pussy. Always."
  },
  {
    "joke": "Before the boogeyman goes to sleep, he checks his closet to make sure Chuck Norris folded all the clothes correctly."
  },
  {
    "joke": "Chuck Norris had to take over on the 7th day of creating whilst God was resting."
  },
  {
    "joke": "Chuck Norris contacted Smallpox. It made him sniffle and it evolved into Ebola. So he blew his nose while on vacation in Liberia."
  },
  {
    "joke": "MacGyver can build an airplane out of gum and paper clips, but Chuck Norris can roundhouse-kick his head through a wall and take it."
  },
  {
    "joke": "In 79 A.D., Chuck Norris took a laxative. As a consequence, the entire city of Pompeii was destroyed."
  },
  {
    "joke": "Chuck Norris owns property in the Uncanny Valley"
  },
  {
    "joke": "Chuck Norris uses ribbed condoms inside out, so he gets the pleasure."
  },
  {
    "joke": "Chuck Norris won the 'Dancing with the Stars' competition by Moonwalking on his butt cheeks."
  },
  {
    "joke": "Chuck Norris was surfing and came face to face with a huge Great White shark. The shark quickly swam away after sustaining a very serious Chuck Norris bite."
  },
  {
    "joke": "Chuck Norris REALLY went back to the future."
  },
  {
    "joke": "Ricky Bobby said, \"If your not first your last.\" Chuck Norris said, \"If your not Chuck Norris, You're dead."
  },
  {
    "joke": "Chuck Norris Lost his virginity before his dad"
  },
  {
    "joke": "Here's a fun fact: CHUCK NORRIS IS YOUR REAL FATHER AND HE SURE AS HELL DON'T LOVE YOU!!"
  },
  {
    "joke": "Nuck Chorris has a fascination with Chuck Norris' penis!!"
  },
  {
    "joke": "Chuck Norris invented Kotex MaxiPads. Originally they were used in hospital ER's to stop profuse bleeding from any part of his victim's body."
  },
  {
    "joke": "All Chuck Norris facts should be told in a respectful whisper, whilst laying one's palms and forehead on the floor."
  },
  {
    "joke": "Chuck Norris maks your average lumberjack look like a hairdresser."
  },
  {
    "joke": "Chuck Norris once beat a ghost to life."
  },
  {
    "joke": "When landing on the moon, Neil Armstrong actually said, 'one small step for man, one giant leap for mankind... and just an average stride for Chuck Norris'"
  },
  {
    "joke": "Chuck Norris once kicked Doyle Brunson's ace."
  },
  {
    "joke": "Chuck Norris dosn't eat submarine sandwiches, he eats submarines..."
  },
  {
    "joke": "Chuck Norris is a true Norriginal."
  },
  {
    "joke": "Chuck Norris can set ants on fire with a magnifying glass. At night."
  },
  {
    "joke": "Chuck Norris doesn't use GUI, he prefers COMMAND line."
  },
  {
    "joke": "Chuck Norris solved the halting problem."
  },
  {
    "joke": "A man once asked Chuck Norris if it was true that he had cheated Death. Chuck Norris merely laughed and said \"Fool! I am Death\" and proceeded to roundhouse kick him mercilessly."
  },
  {
    "joke": "As long as chuck Norris lives in planet earth there will be no asteroid or aliens that would dare touch our planet. That's why he doesn't do asteroids, or alien invasion movies, cause they won't have any sense."
  },
  {
    "joke": "Chuck Norris wishes you a knuckle sandwich, and a happy throat-punch."
  },
  {
    "joke": "Every morning Chuck Norris gets up and pisses excellence."
  },
  {
    "joke": "Bill Gates recently received a video tape of Chuck Norris holding up Steve Jobs' severed head and repeating 'you're next, egghead'."
  },
  {
    "joke": "Chuck Norris sired a baseball team...and a football team if you count all of the bastards."
  },
  {
    "joke": "coyote vs road runner is just a performance how fast can Chuck Norris bip-iping"
  },
  {
    "joke": "Chuck Norris doesn't flush the toilet...He just scares the shit right out of it!"
  },
  {
    "joke": "Chuck Norris terminated the terminator."
  },
  {
    "joke": "Chuck Norris once threw a knife into Heaven."
  },
  {
    "joke": "Someone once used Chuck Norris' name in a men's restroom graffiti. That is correct, \"once\"! The body of a castrated man was later found by police floating in the city sewer system."
  },
  {
    "joke": "Chuck Norris can text using his walkie talkie and without batteries."
  },
  {
    "joke": "The bathroom comes to Chuck Norris."
  },
  {
    "joke": "people who live in glass houses shouldn't throw stones Chuck Norris can throw glass at stone houses"
  },
  {
    "joke": "If you ever talk to a woman who has been on a date with Chuck Norris, and she says, \"he was a little pushy\", you know she's lying. Chuck Norris isn't 'a little' anything."
  },
  {
    "joke": "Chuck Norris is a cunt!....hang on theres someone at the door"
  },
  {
    "joke": "If you ever see Chuck Norris' O face, you will turn to stone"
  },
  {
    "joke": "Most atheists agree that Chuck Norris is God's gift to mankind"
  },
  {
    "joke": "a blind man once walked in to Chuck Norris chuck said do you know who i am im Chuck Norris. the mere mention of his name cured his blindness but sadly the first last and only thing he saw was a deadly round house kick to the face"
  },
  {
    "joke": "Miley Cyrus was inspired to do Wrecking Ball after actually swinging on one of Chuck Norris's balls."
  },
  {
    "joke": "Cancerous growths have been found on tobacco plants growing in fields that Chuck Norris had walked through."
  },
  {
    "joke": "Believe it or not, CHUCK NORRIS IS RIGHT BEHIND YOU!"
  },
  {
    "joke": "Chuck Norris once dug a hole all the way to the moon."
  },
  {
    "joke": "Chuck Norris can put you in a coma by slapping you in the face with his dick."
  },
  {
    "joke": "Chuck Norris has 2 deadly weapons - his roundhouse kick is a weapon of mass destruction while his penis is a weapon of mass reproduction."
  },
  {
    "joke": "When Chuck Norris was born, He got a choice - A big dick or a good memory. Chuck Norris can't remember what he chose."
  },
  {
    "joke": "Chuck Norris doesn't get mail. He gets chain mail."
  },
  {
    "joke": "The upcoming debut album by the Chuck Norris Experience is expected to become the highest-selling album of all time."
  },
  {
    "joke": "I know where Chuck Norris is. Chuck Norris knows where I live too, WERE EVEN!"
  },
  {
    "joke": "A pair of Chuck Norris' jeans was recently put up for auction. The leg reflexively kicked three appraisers."
  },
  {
    "joke": "Chuck Norris favorite cartoon TV show is WWE."
  },
  {
    "joke": "Chuck Norris use to eat clowns but they taste funny."
  },
  {
    "joke": "Solid Snake has a beard because Chuck Norris bit his chin an it became a fist"
  },
  {
    "joke": "Chuck Norris made the president of the feminist movement his beer wench."
  },
  {
    "joke": "Chuck Norris can ice skate with roller blades"
  },
  {
    "joke": "the atlantic space shuttle explose because it wasnt made of Chuck Norris beard"
  },
  {
    "joke": "Chuck Norris went to a fertility clinic to donate a sperm sample. There were no survivors."
  },
  {
    "joke": "Surprisingly, the only Street Fighter II move based on one of Chuck Norris' was Chun-Li's. Chuck Norris prefers to travel by performing four upside-down double-roundhouse kicks per second."
  },
  {
    "joke": "Chuck Norris broke the sound barrier whilst head banging"
  },
  {
    "joke": "A man woke in Intensive Care with severe injuries and no memory of what happened. An investigation determined he was hit by either a freight train or by Chuck Norris."
  },
  {
    "joke": "Chuck Norris once ate an entire wildebeest with a broken KFC spork."
  },
  {
    "joke": "Chuck Norris created \"Where's Waldo?\". He wasn't a fan of the name Waldo, so he round house kicked him in the face and no one has seen Waldo since...hence where's Waldo?"
  },
  {
    "joke": "Chuck Norris has counted to infinity and negative infinity, mutliple times, while waiting in line at the DMV."
  },
  {
    "joke": "The last time Chuck Norris went carolling, he wound up getting signed to a five-album solo contract with Sony."
  },
  {
    "joke": "When god create Chuck Norris, god not exist anymore"
  },
  {
    "joke": "Chuck Norris gargles with thumbtacks."
  },
  {
    "joke": "A top rated MMA fighter named Thunderclap decided to take on Chuck Norris. After Chuck slapped him silly, Thunderclap referred to Chuck as \"Nightmare Norris\"."
  },
  {
    "joke": "The Internet was invented by Chuck Norris so that he could deliver roundhouse kicks worldwide from the comfort of his own home."
  },
  {
    "joke": "Chucky has a Chuck Norris doll"
  },
  {
    "joke": "Chuck Norris roundhouse kicked a man in a wheelchair in the ground people dug that fossil up it is now a handicap parking sign but really it is a warning that Chuck is coming"
  },
  {
    "joke": "Chuck Norris discovered a new theory of relativity involving multiple universes in which Chuck Norris is even more badass than in this one. When it was discovered by Albert Einstein and made public, Chuck Norris roundhouse-kicked him in the face. We know Albert Einstein today as Stephen Hawking."
  },
  {
    "joke": "Chuck Norris' prostate is used to examine doctor's fingers."
  },
  {
    "joke": "One factory in Texas decided to motivate their employees by hanging posters of Chuck Norris with the message \"Don't Piss Off Chuck -- Do Your Work.\"  Production increased by 500% within 6 months."
  },
  {
    "joke": "Chuck Norris is the only man in history to win a Tag Team championship solo."
  },
  {
    "joke": "Chuck Norris' ranch is home to the world's largest stockpile of ungiven fucks."
  },
  {
    "joke": "Chuck Norris where's a black belt around the beard that he grows on his dick"
  },
  {
    "joke": "Chuck Norris invented the bolt-action rifle, liquor, sexual intercourse, and football ... in that order."
  },
  {
    "joke": "Chuck Norris doesnt need a guard dog a guard dog needs him"
  },
  {
    "joke": "Chuck Norris' shit easily sinks lower than whale shit."
  },
  {
    "joke": "Chuck Norris' accent wears a tuxedo."
  },
  {
    "joke": "Chuck Norris' beard has a Twitter account, a Myspace page, and a bestselling biography by Mick Wall. A HBO miniseries is currently in the works."
  },
  {
    "joke": "Chuck Norris once punched Jean-Claude Van Damme in his career."
  },
  {
    "joke": "When most people think of \"bone china,\" they think of flatware.  Chuck Norris is reminded of the three weeks he spent sampling the best whorehouses in Hong Kong back in '78."
  },
  {
    "joke": "If Mohammed wont go to the mountain then Chuck Norris will fucking drag him there."
  },
  {
    "joke": "The earth did not end on December 21 2012. But That is not because the Mayans were wrong, but because Chuck Norris had lunch planned for next week. Nothing gets between chuck Norris and his lunch!"
  },
  {
    "joke": "Chuck Norris has surpassed Jesus Christ in Internet search volume."
  },
  {
    "joke": "Chuck Norris has the greatest Poker-Face of all time. He won the 1983 World Series of Poker, despite holding only a Joker, a Get out of Jail Free Monopoloy card, a 2 of clubs, 7 of spades and a green #4 card from the game UNO."
  },
  {
    "joke": "Chuck Norris once rammed a banjo up a bull's butt, and then hit it."
  },
  {
    "joke": "Davy Crockett shot his first bear when he was only 3. Chuck Norris roundhouse kicked his first bear into oblivion when he was only 6 months old."
  },
  {
    "joke": "Scotty in Star Trek often says \"Ye cannae change the laws of physics.\" This is untrue. Chuck Norris can change the laws of physics. With his fists."
  },
  {
    "joke": "You can lead a horse to water, but Chuck Norris can make him eat Tequila jello shots."
  },
  {
    "joke": "theres: 1st degree burns 2nd degree burns 3rd degree burns and Chuck Norris degree burn other words dust"
  },
  {
    "joke": "Chuck Norris once beat someone to death with water."
  },
  {
    "joke": "Face your problems, unless your face is the problem which Chuck Norris roundhouse kicked."
  },
  {
    "joke": "Chuck Norris doesn't own a can opener, he just chews through the can."
  },
  {
    "joke": "Chuck Norris has submitted internet forms without posting all required information because he is a machine - not a mere man."
  },
  {
    "joke": "Had Chuck Norris been present at the Battle of the Alamo, the southern border of Texas would be extended a few thousand miles to Guatemala."
  },
  {
    "joke": "Most people receive Chuck Norris' kicks while he is wearing his cowboy boots. Receiving a bare-feet Chuck Norris roundhouse kick is considered auspicious in some countries."
  },
  {
    "joke": "Chuck Norris was the Fourth Wiseman. He gave Baby Jesus the gift of Beard. Jesus loved it so much the other Wisemen were jealous of his obvious gift favoritism. They then used their combined influence to have Chuck Norris omitted from the Bible. All three later died mysteriously from roundhouse-kick related issues."
  },
  {
    "joke": "Chuck Norris knows how to shut down Skynet. Warner Bros beged him not to so they can make some money out of it."
  },
  {
    "joke": "Chuck Norris once knocked a woman out with his ejaculation."
  },
  {
    "joke": "Rome was not built in day because Chuck Norris was not there to do the job right."
  },
  {
    "joke": "When landing on the moon, Neil Armstrong actually said, 'one small step for man, one giant leap for mankind... and just an average stride for Chuck Norris'"
  },
  {
    "joke": "Chuck Norris Can See Thunder."
  },
  {
    "joke": "If you see Chuck Norris fighting a bear, don't help Chuck Norris, help the bear. \""
  },
  {
    "joke": "Chuck Norris can play angry birds, listen to music and watch movies on a pay-phone... and all for free"
  },
  {
    "joke": "In the Bible, Jesus turned water into wine. But then Chuck Norris turned that wine into beer."
  },
  {
    "joke": "Even at age 72, Chuck Norris isn't considered to have reached old age. If old age were ever stupid enough to reach for big Chuck, he would break its fucking wrist and throw it through a plate-glass window."
  },
  {
    "joke": "Chuck Norris doesn't go places, places go to Chuck Norris"
  },
  {
    "joke": "when alexander gram bell inveted the first phone he already had 2 missed calls from Chuck Norris"
  },
  {
    "joke": "Chuck Norris is the world's greatest gamer. He completed every possible scenrio in Skyrim while standing on his head, blindfolded, wearing earplugs, hands tied behind his back, with an arrow stuck in his knee...& while using an old Guitar Hero controller. Awesome!"
  },
  {
    "joke": "Scientist have tried to come up with a theory for how Chuck Norris came to be... we now know this theory as the \"Big Bang\""
  },
  {
    "joke": "Chuck Norris made One Direction go two ways."
  },
  {
    "joke": "Chewbacca says \"Sir\" to no one except Chuck Norris"
  },
  {
    "joke": "Chuck Norris invented the alphabets cos he was tired of being the only man with education."
  },
  {
    "joke": "If you ask Chuck Norris how to be famous, he will show you. You will regain conciousness with a crowd around you."
  },
  {
    "joke": "Chuck Norris can solve a Rubik's Cube with his butt-cheeks."
  },
  {
    "joke": "Chuck Norris won the Daytona 500 in a Barbie Jeep."
  },
  {
    "joke": "If you see Chuck Norris at a picnic, beware: Chuck Norris can decapitate anyone at any time with a flying paper plate."
  },
  {
    "joke": "Gravity is so intense in a black hole that it actually distorts time and space, leaving absolutely no chance of escape or survival. Chuck Norris walks through six black holes every morning because he needs more time to kill people in different places."
  },
  {
    "joke": "Chuck Norris was at a rap concert once and the rapper told everyone to raise the roof. Promptly afterward he killed the rapper with a swift roundhouse kick to the face. No one tells Chuck Norris what to do."
  },
  {
    "joke": "'Tsunami' is japanese for 'Chuck Norris san'"
  },
  {
    "joke": "Chuck Norris can cover a Beatles song on Youtube and won't get comments saying he ruined the song."
  },
  {
    "joke": "Chuck Norris's casket will be in the shape of a gigantic letter \"L,\" to accommodate his penis.  CORRECTION: Neither Chuck Norris nor his penis will die."
  },
  {
    "joke": "MacGyver can build an airplane out of gum and paper clips. Chuck Norris can kill him and take it."
  },
  {
    "joke": "This is Chuck Norris fact #9000. Only eleven billion to go."
  },
  {
    "joke": "Chuck Norris can blow bubbles by chewing ghost chilis."
  },
  {
    "joke": "Chuck Norris is known to jump out of televisions and roundhouse kick the viewers for no reason at all. Extreme caution is advised while watching any shows involving Chuck Norris."
  },
  {
    "joke": "In Las Vegas casinos, Chuck Norris can fold and still win...in blackjack."
  },
  {
    "joke": "Chuck Norris doesn't take an arrow to the knee, he takes his knee to the arrow"
  },
  {
    "joke": "Chuck Norris is the reason why nuclear bombs were invented."
  },
  {
    "joke": "When Steven Seagal kills a ninja, he only takes its hide. When Chuck Norris kills a ninja, he uses every part."
  },
  {
    "joke": "When bored, Chuck Norris will play Hopscotch on your face."
  },
  {
    "joke": "Mickey Mantle's longest home run travelled about 565 feet from home plate  Chuck Norris' longest home run travelled about 565 light years from home plate."
  },
  {
    "joke": "Ironically, Chuck Norris once drowned an elephant in a 5,000 gallon vat of peanut oil."
  },
  {
    "joke": "Danny De Vito used to be over seven feet tall before his Chuck Norris pile-drive."
  },
  {
    "joke": "Chuck Norris hit a hole-in-one on the 18th hole at Pebble Beach, California from the 1st tee at Bethpage Black, New York."
  },
  {
    "joke": "Once Chuck Norris took a Vacation to the bahamas,he was watching oprah when she said somthing funny he pissed himself and laughed so hard is started hurracane katrina"
  },
  {
    "joke": "Chuck Norris uses a live Cobra for a hatband. It stays in place because it's frozen in fear."
  },
  {
    "joke": "Chuck Norris staged the moon landing in his back garden"
  },
  {
    "joke": "A handicapped parking sign does not signify that this spot is for handicapped people. It is actually in fact a warning, that the spot belongs to Chuck Norris and that you will be handicapped if you park there."
  },
  {
    "joke": "Chuck Norris solved the halting problem."
  },
  {
    "joke": "If Chuck Norris goes through a turnstile sideways, the new capitol of Thailand will \"Busted Turnstile\"."
  },
  {
    "joke": "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa Chuck Norris!"
  },
  {
    "joke": "Chuck Norris loves all that shit Andrew Zimmern eats on bizzare foods"
  },
  {
    "joke": "Chuck norris my ass ! Chuck Norris is nothing but a lie .. if the things they say is truth he would come here at my pc and bang my head against the key2fg782345fgds89yqw3rq2ajkfsd[0fg9aew91234fsdkag a9r 723qtyr8 aw rfes p98raff"
  },
  {
    "joke": "They once made Chuck Norris toilet paper. The only problem was that it wouldn't take shit from no one!"
  },
  {
    "joke": "Chuck Norris invented the nipple cripple."
  },
  {
    "joke": "When Sir Edmund Hillary first climbed to the summit of Everest, he saw empty beer cans, condoms and cigar butts strewn around, plus a giant snow angel and the words 'CHUCK NORRIS BEAT YOU, BITCH' written in urine in the snow."
  },
  {
    "joke": "Chuck Norris can charge a cars battery by connecting the cables to his nipples"
  },
  {
    "joke": "the answer to the question whick goes first chicken or egg, the answer is CHUCK NORRIS"
  },
  {
    "joke": "Chuck Norris likes to pull Steven Segal's girly little ponytail and then stare at him when he turns around, daring him to make the first move."
  },
  {
    "joke": "Chuck Norris got his legs cut off and still managed to get up and walk it off."
  },
  {
    "joke": "EVERY DAY I'M SHUFFLIN'... - CHUCK NORRIS"
  },
  {
    "joke": "Chuck Norris' saliva is used to euthanize Komodo dragons."
  },
  {
    "joke": "Chuck Norris ended world hunger with one knuckle sandwich."
  },
  {
    "joke": "Chuck Norris doesn't consider it good sex unless the women dies."
  },
  {
    "joke": "Chuck Norris solved the Travelling Salesman problem in O(1) time. Here's the pseudo-code: Break salesman into N pieces. Kick each piece to a different city."
  },
  {
    "joke": "Chuck Norris has no friends on Facebook. Just enemies."
  },
  {
    "joke": "The day before the MTV awards, Miley was broken in by Chuck Norris."
  },
  {
    "joke": "Chuck Norris CAN fool the Children Of The Revolution. Then roundhouse kick them in the face."
  },
  {
    "joke": "Chuck Norris forced Bill Cosby to rape Bruce Jenner."
  },
  {
    "joke": "Chuck Norris's \"Will\" will never be stronger than Chuck Norris."
  },
  {
    "joke": "Why are Jay-Z's lips so big? Chuck Norris."
  },
  {
    "joke": "Chuck Norris has 3 birthdays a year"
  },
  {
    "joke": "Chuck Norris recently had his entire scrotum tattooed black, just to show everyone who the fuck Chuck is. He whiled away the 15-hour process by lifting weights and recieving blowjobs."
  },
  {
    "joke": "When Chuck Norris got his Polio shot as a child, the doctor needed a crossbow bolt covered in the immunisation fluid."
  },
  {
    "joke": "Some have said to seeing Chuck Norris levitate. Truth is, Earth just moves down when he farts."
  },
  {
    "joke": "Hitler killed himself the year Chuck Norris died... COINIDENCE?!?!?!"
  },
  {
    "joke": "Chuck Norris officially pimped Xzibit."
  },
  {
    "joke": "Chuck Norris ejaculates pure liquid mercury"
  },
  {
    "joke": "Chuck Norris invented decaf coffee by punching a coffee bean."
  },
  {
    "joke": "Chuck Norris was originally cast in the hit film taken but he got his daughter back before the end of the opening scene"
  },
  {
    "joke": "Chuck Norris once roundhouse kicked a cotton field in Mississippi instantly creating the first Levis factory as well as adorning his torso with a sleeveless denim vest"
  },
  {
    "joke": "Women who think about having sex with Chuck Norris develope Blue Waffle Disease."
  },
  {
    "joke": "Chuck Norris sells his dickfat to cosmetic surgeons as an alternative to collagen."
  },
  {
    "joke": "If you see Chuck Norris, and he's moving, it's already too late to run."
  },
  {
    "joke": "The Chuck Norris Facts sites are actually pages taken from Chuck Norris daily diary"
  },
  {
    "joke": "When bored, Chuck Norris will play Hopscotch on your face."
  },
  {
    "joke": "Some people are lactose intolerant. Dairy is Chuck Norris intolerant."
  },
  {
    "joke": "Whenever there is an earthquake, know that Chuck Norris is not very far away.... and the earth knows it"
  },
  {
    "joke": "chances are by the time you meet Chuck Norris, you've already been roundhoused."
  },
  {
    "joke": "Chuck Norris has delivered enough roundhouse kicks to the ass to know just how many of them it takes to make a bountiful bouquet of hemorrhoids."
  },
  {
    "joke": "Chuck Norris cannot predict the future; the future just better do what Chuck Norris says."
  },
  {
    "joke": "Chuck Norris does not own a stove, oven, or microwave , because revenge is a dish best served cold."
  },
  {
    "joke": "A Chuck Norris roundhouse kick to your solar plexus will cause your toenails to crack."
  },
  {
    "joke": "Chuck Norris makes a world famous tray of chocolate chip/macadamamia flavored Snickerdoodle cookies from his dingle berries and toe jam."
  },
  {
    "joke": "Life is in no way as large as Chuck Norris"
  },
  {
    "joke": "i dont know why people treat Chuck Norris like hes a killer he has the heart of a child which isa bad thing"
  },
  {
    "joke": "Chuck Norris once went over Mach 4 using a hang glider."
  },
  {
    "joke": "CNN was originally created as the \"Chuck Norris Network\" to update Americans with on-the-spot ass kicking in real-time."
  },
  {
    "joke": "Long ago, Jesus turned water into wine, but then Chuck Norris turned that wine into beer."
  },
  {
    "joke": "Chuck Norris is a true conservationist. He always reassembles his exploded grenades for reuse."
  },
  {
    "joke": "The last person that goosed Chuck Norris lost a finger, hand and forearm from his crimped butt cheeks."
  },
  {
    "joke": "Chuck Norris built the Panama Canal with his left foot."
  },
  {
    "joke": "Chuck Norris once acquired two Harley-Davidsons by Karate-chopping a muscle car in half."
  },
  {
    "joke": "Chuck norris barfes rainbows"
  },
  {
    "joke": "Every time Chuck Norris smiles, someone dies. Unless he smiles while he?s roundhouse kicking someone in the face. Then two people die."
  },
  {
    "joke": "Chuck Norris casually goes where no man has ever gone before."
  },
  {
    "joke": "Flash the superhero tried running from Chuck Norris.....he didnt get far"
  },
  {
    "joke": "Chuck Norris doesn't say \"who's your daddy\", because he knows the answer."
  },
  {
    "joke": "Chuck Norris was on safari in Africa when his rifle jammed. He still took his trophy lion by chasing it down and choking it out with his bare hands."
  },
  {
    "joke": "Chuck Norris banged the tooth fairy."
  },
  {
    "joke": "Chuck Norris hijacked Noah's ark during the flood."
  },
  {
    "joke": "Chuck Norris doesnt have to have a no solicating sign on his door. he just pee's around the door and sales men know to leave as fast as they can or they will have 5 sec left to live"
  },
  {
    "joke": "Chuck Norris is so fast he can turn off the light and be in bed before it's dark."
  },
  {
    "joke": "Freddy thought he was the true nightmare until he met Chuck Norris who roundhouse kicked and from that day Freddy hides in fear thinking a nightmare in texas"
  },
  {
    "joke": "Chuck Norris thinks somebody has no sense of humor & needs a roundhouse to the rucksack."
  },
  {
    "joke": "The real reason of the tsunami was because Chuck Norris threw a rock from texas and it landed in the indian ocean."
  },
  {
    "joke": "Chuck Norris can impregnate Hercules just by pointing at him."
  },
  {
    "joke": "Chuck Norris humps camels, shags carpets and bones China."
  },
  {
    "joke": "When Chuck Norris calls 911 it's to ask if everything is ok."
  },
  {
    "joke": "Chuck Norris' last kid was born 10 months after his 23rd vasectomy."
  },
  {
    "joke": "Jesus can walk on water, Chuck Norris can swim through land."
  },
  {
    "joke": "Why do so many rock stars die at age 27? Chuck Norris"
  },
  {
    "joke": "Chuck Norris can tear a hole in the very fabric of space-time by simply rubbing his hands together."
  },
  {
    "joke": "A reporter asked Chuck Norris what he thought when the news runs a story about the Kardashians. Chuck said \"I think that's a good time to take a big dump\"."
  },
  {
    "joke": "Chuck Norris can win a game of rock-paper-scissors with his boot."
  },
  {
    "joke": "Chuck Norris can rehydrate petrified wood by urinating on it."
  },
  {
    "joke": "Chuck Norris is not only a noun but a verb"
  },
  {
    "joke": "Chuck Norris's tears cure cancer...... to bad he has never cried never 8*>"
  },
  {
    "joke": "Chuck Norris doesn't follow trends, he sets them."
  },
  {
    "joke": "One time while sparring with Wolverine, Chuck Norris accidentally lost his left testicle. You might be familiar with it to this very day by its technical term: Jupiter."
  },
  {
    "joke": "If The Most Interesting Man in the World were to slap you on the back, you'd put it on your resume.  If Chuck Norris were to slap you on the back, your spine would leave the Earth's atmosphere at about Mach 2."
  },
  {
    "joke": "people who live in glass houses shouldn't throw stones Chuck Norris can throw glass at stone houses"
  },
  {
    "joke": "Why is Chuck Norris artificial fertilized?....Because nobody fucks his mother."
  },
  {
    "joke": "The cookie crumbled because Chuck Norris glanced at it"
  },
  {
    "joke": "After Chuck Norris was born, he drove himself back home."
  },
  {
    "joke": "Chuck Norris isn't given tests. He TAKES them."
  },
  {
    "joke": "Chuck Norris thinks condoms are for making Hennessy popsicles in the freezer."
  },
  {
    "joke": "Chuck Norris can divide by zero and not get error in an calculator"
  },
  {
    "joke": "Chuck Norris has six assholes. And even he will need them all to shit enough corn & peanuts infused feces on the U.S. House of Representatives."
  },
  {
    "joke": "The U.S. Constitution's ban on cruel and unusual punishment specifically exempts Chuck Norris."
  },
  {
    "joke": "Chuck Norris can smell your fear just by looking at you."
  },
  {
    "joke": "Homeless people are afraid to ask Chuck Norris for change. The last guy who did got a half dollar scissor kicked up his ass...twice."
  },
  {
    "joke": "Chuck Norris once shot a flea through the heart with a .44 Magnum."
  },
  {
    "joke": "Chuck Norris recently got Sylvester Stallone in a headlock and told him 'motherfucker if I ever hear you fucking swear I will motherfucking kill your entire motherfucking family, bitch'."
  },
  {
    "joke": "Osama Bin Laden wasn't that good at hiding. Obama just had to pay Chuck Norris to go on holiday for one night"
  },
  {
    "joke": "Chuck Norris knows what you did last summer."
  },
  {
    "joke": "Chuck Norris rode his sway-backed mule named Thudly to the 2014 Kentucky Derby winners circle."
  },
  {
    "joke": "Chuck Norris once kept a woman on the verge of orgasm for 97 days. When he let her have it, it shook chunks of brick out of her apartment building."
  },
  {
    "joke": "Sharon Stone parted her legs for Chuck Norris."
  },
  {
    "joke": "in stead of a chin under hes beard, Chuck Norris only has another fist"
  },
  {
    "joke": "Chuck Norris was born while his mother was lion hunting on the African Savanna. Just seconds later he strangled a hyena with his own umbilical cord."
  },
  {
    "joke": "Chuck Norris can taste lies."
  },
  {
    "joke": "Chuck Norris does not urinate. He excretes crystals of hardened urea, which are polished by Egyptians and used as diamonds."
  },
  {
    "joke": "Cannibals worship King Kong. King Kong worships Chuck Norris."
  },
  {
    "joke": "Chuck Norris gets more upper-class pussy than the first boat off of the Titanic."
  },
  {
    "joke": "A single death is a tragedy; Chuck Norris roundhouse kick to the face is a statistic."
  },
  {
    "joke": "When you're Chuck Norris, anything + anything is equal to 1. One roundhouse kick to the face."
  },
  {
    "joke": "Chuck Norris likes to pull Steven Segal's girly little ponytail and then stare at him when he turns around, daring him to make the first move."
  },
  {
    "joke": "Chuck Norris can take a selfie with both hands tied behind his back"
  },
  {
    "joke": "Chuck norris once killed a postman.He then waved his finger side to side and said \"hey buddy only i deliver round houses, got it!\""
  },
  {
    "joke": "Chuck Norris once took a dump on the African savannah while on safari. Later, 2,300 dung beetles were found OD'ing in a state ecstasy."
  },
  {
    "joke": "Chuck Norris got the most kills in a battle ground without no pvp gear or weapon"
  },
  {
    "joke": "Chuck Norris won the 'Dancing with the Stars' competition by Moonwalking on his butt cheeks."
  },
  {
    "joke": "Miley Cyrus calls Chuck Norris daddy."
  },
  {
    "joke": "Chuck Norris doesnt play by the rules. the rules play by Chuck Norris"
  },
  {
    "joke": "Chuck Norris can beat an Englishman in an impersonating British accents."
  },
  {
    "joke": "Little known fact: Chuck Norris shot J.R. after he killed him with a spectacular roundhouse kick to the forehead."
  },
  {
    "joke": "It's said that, when this website gets to Fact #9001, Chuck Norris will kick it in the URL, rocketing it up to 10,000 facts."
  },
  {
    "joke": "Chuck Norris once punched a guy so hard he turned into a gravestone."
  },
  {
    "joke": "Chuck Norris is suing CNN for using two of his initials in there name..."
  },
  {
    "joke": "Chuck Norris is so fast that when he stops he has to wait for his shadow to arrive."
  },
  {
    "joke": "Chuck Norris used to throw shoes at Dubya all the time."
  },
  {
    "joke": "When Chuck Norris was 9 he was out trick or treating and ran into Freddy Kruger. Chuck kicked the crap out of Freddy then took his candy."
  },
  {
    "joke": "People talk about what a bad ass Chuck Norris is and I just don't get it . I think it's all made up. To me he is just a regular just a minute someone at the the door..."
  },
  {
    "joke": "there are no such thing as a tornado Chuck Norris just don't like trailer parks."
  },
  {
    "joke": "When Chuck Norris was a bartender he invented a drink called the \"Colon Slammer\". It was made with Vodka and Prune juice."
  },
  {
    "joke": "During the Vietnam War, Chuck Norris allowed himself to be captured. For torture, they made him eat his own entrails. He asked for seconds."
  },
  {
    "joke": "Chuck norris can mxit on a public phone"
  },
  {
    "joke": "Chuck Norris was expelled from the 5th grade when he took Steve, his pet Velociraptor for show and tell."
  },
  {
    "joke": "CHUCK NORRIS ONCE DONE THE SPLITS ON 2 VAN DAMMES"
  },
  {
    "joke": "The earth has a bigger dick than Chuck Norris but Chuck Norris's dick is 3 times bigger than the earths.\n"
  },
  {
    "joke": "Chuck Norris was what Willis was talkin' about."
  },
  {
    "joke": "A man once claimed Chuck Norris kicked his ass twice, but it was promptly dismissed as false - no one could survive it the first time."
  },
  {
    "joke": "Chuck Norris has a Grizzly Bear rug laid out on his family room floor. The Grizzly Bear isn't dead...it's just too afraid to move."
  },
  {
    "joke": "Chuck Norris invented Hip Hop so that he could hate on Hip Hop artists and roundhouse kick them for his personal entertainment while watching Walker Texas Ranger on TV."
  },
  {
    "joke": "when neil armstrong landed on the moon he saw Chuck Norris fucking a hot chick in the ass"
  },
  {
    "joke": "Chuck Norris can make a woman orgasm so hard, she screams cum out her mouth."
  },
  {
    "joke": "Movies and TV shows fail when they do not impress Chuck Norris."
  },
  {
    "joke": "Like this to get an instant download of Chuck Norris's Walker Texas Ranger theme song as ur Ringtone!"
  },
  {
    "joke": "Chuck Norris' face was going to be on Mt. Rushmore, but the granite wasn't tough enough for his beard"
  },
  {
    "joke": "The US did not boycot the 1980 Summer Olympics. Chuck Norris was the only US qualifier for every event. He decided not to compete because there was no challenge."
  },
  {
    "joke": "Chuck Norris can tech an old dog the kind of tricks that would make that Mindfreak guy's head explode."
  },
  {
    "joke": "Chuck Norris' family crest is a picture of a baracudda eating Queen Elizabeth."
  },
  {
    "joke": "chuck Norris just roundhouse kicked billy ray cyrus for mileys twerking"
  },
  {
    "joke": "Confucius say: Wise man never stand infront of bull, never stand behind mule, never stand infront or behind Chuck Norris."
  },
  {
    "joke": "Chuck Norris can gag you with a horrendous stinch simply by typing the word \"fart\" on his computer keyboard."
  },
  {
    "joke": "WHEN WE'RE HUNGRY CHUCK NORRIS WILL KEEP US ALIVE"
  },
  {
    "joke": "Chuck Norris doesn't have a penis, he had a 6 foot pipe."
  },
  {
    "joke": "The saddest moment for a child is not when he learns Santa Claus isn't real, it's when he learns Chuck Norris is."
  },
  {
    "joke": "When life gives you lemons, you make lemonade. When life gives Chuck Norris lemons, he makes apple juice."
  },
  {
    "joke": "All roads lead to Chuck Norris. And by the transitive property, a roundhouse kick to the face."
  },
  {
    "joke": "Chuck Norris doesn't believe Feminism exists, because women can't resist Chuck Norris."
  },
  {
    "joke": "Chuck Norris doesn't have disk latency because the hard drive knows to hurry the hell up."
  },
  {
    "joke": "The National Weather Service was going to name a hurricane after Chuck Norris but television stations would not allow them to call it \"Hurricane Fuck'em Up Chuck\"."
  },
  {
    "joke": "Chuck Norris is the reason why bats can't see cause they took one look at him and they went blind."
  },
  {
    "joke": "The rock band Queen wrote the song \"We will rock you\" about Chuck Norris fists."
  },
  {
    "joke": "Chuck Norris suffers from a severe case of Stickittodamaneosis."
  },
  {
    "joke": "Chuck Norris' \"little black book\" was recently used by the Texas government to compile their last phone directory."
  },
  {
    "joke": "A dentist once lost his arm trying to remove a young Chuck Norris' tonsils."
  },
  {
    "joke": "Titanic did'nt sink because of an iceberg, it hit Chuck Norris on his morning swim..."
  },
  {
    "joke": "Rome was not built in day because Chuck Norris was not there to do the job right."
  },
  {
    "joke": "kids piss there name n snow Chuck Norris pisses his name in concrete"
  },
  {
    "joke": "Chuck Norris once actually made it rain cats and dogs just so he could solve a mouse problem."
  },
  {
    "joke": "Chuck Norris style is like a swollen penis. You can't beat him."
  },
  {
    "joke": "Chuck Norris can revolve a wooden door"
  },
  {
    "joke": "Chuck Norris converted Bermuda triangle into Bermuda pants."
  },
  {
    "joke": "If you are next to Chuck Norris then you will always have perfect cell phone reception"
  },
  {
    "joke": "Chuck norris my ass ! Chuck Norris is nothing but a lie .. if the things they say is truth he would come here at my pc and bang my head against the key2fg782345fgds89yqw3rq2ajkfsd[0fg9aew91234fsdkag a9r 723qtyr8 aw rfes p98raff"
  },
  {
    "joke": "In ancient Greece, Chuck Norris killed a man, screwed his wife, then set-up Oedipus to take the fall for it. Later, Oedipus fell in love with the widow and married her."
  },
  {
    "joke": "Conor McGregor is Chuck Norris' illegitimate son."
  },
  {
    "joke": "When Chuck Norris goes to out to eat, he orders a whole chicken, but he only eats its soul."
  },
  {
    "joke": "Chuck Norris can eat his own head and still have room for dessert"
  },
  {
    "joke": "The movie \"anaconda\" was shot in Chuck Norris' underwear"
  },
  {
    "joke": "Chuck Norris had to stop setting his phone to vibrate, the earthqaukes where killing people."
  },
  {
    "joke": "Chuck Norris doesn't wear condoms because there's no protections from Chuck Norris."
  },
  {
    "joke": "Chuck Norris once round house a chevy and a ford was invented"
  },
  {
    "joke": "Chuck Norris keeps his friends close and his enemies in the morgue."
  },
  {
    "joke": "bigfoot doesn't exist, parker just took a picture after Chuck Norris went on a camping trip and moths ate his clothes."
  },
  {
    "joke": "A study showed the leading causes of death in the United States are: 1. Heart disease, 2. Chuck Norris, 3. Cancer"
  },
  {
    "joke": "Chuck Norris once took a dump on the African savannah while on safari. Later, 2,300 dung beetles were found OD'ing in a state ecstasy."
  },
  {
    "joke": "A good golfer can often make a 'birdie'. Better golfers frequently get an 'eagle'. Chuck Norris always gets a 'vulture'."
  },
  {
    "joke": "Chuck Norris can eat an a whole plate of fried rice in under 1 second... using a single chopstick."
  },
  {
    "joke": "The last time Chuck Norris had a crab salad was when he ate your wife's box lunch."
  },
  {
    "joke": "Chuck Norris killed the trolls. Happy now?"
  },
  {
    "joke": "Chuck Norris can beat the impossible game......without dying."
  },
  {
    "joke": "A Chuck Norris punch to the back of your skull will change your forehead into a fivehead."
  },
  {
    "joke": "Chuck Norris is the only man ever to simultaneously score an Ippon in judo, put his opponent in checkmate and give a woman multiple orgasms with oral sex."
  },
  {
    "joke": "Chuck Norris wishes that he could understand this 'fear' shit."
  },
  {
    "joke": "Chuck Norris was at the X-games getting ready for competition when he got a message from Paris Hilton saying that she had sent him a friend request on MySpace. An infuriated Chuck Norris logged on to MySpace using his skateboard and rejected the request immediately."
  },
  {
    "joke": "Without question, the greatest invention in the history of mankind was beer. Chuck Norris invented beer. Granted, the wheel was also a fine invention but you can't serve a wheel with pizza which was also invented by Chuck Norris."
  },
  {
    "joke": "Chuck Norris should win the Nobel Peace Prize, because when he starts a war, it's over before it begins."
  },
  {
    "joke": "Chuck Norris can rob a bank with just his vocal cords."
  },
  {
    "joke": "Chuck Norris an translate Japanese sign language into Russian Pig Latin."
  },
  {
    "joke": "Chuck Norris cleans his earwax out with a Dremel tool."
  },
  {
    "joke": "When Chuck Norris was 3 years old, he went Back to the Future in his Little Tikes car."
  },
  {
    "joke": "Chuck Norris can cure your cataracts with taser eye surgery."
  },
  {
    "joke": "The City of Douche, NJ formally changed it's name to Hackensack after Chuck Norris spent a night in the local Motel 6 & simultaniously screwed 12 of the city's female taxi drivers."
  },
  {
    "joke": "we truly never dropped an atomic bomb on Hiroshima, we just dropped Chuck Norris"
  },
  {
    "joke": "A Chuck Norris roundhouse kick to the head is the reason Eric Holder can't remember his involvement in Operation Fast and Furious."
  },
  {
    "joke": "Chuck Norris put out Hell."
  },
  {
    "joke": "Chuck Norris was once so drunk that he tripped and the ejecta that was launched into outer space formed the moon."
  },
  {
    "joke": "CHUCK NORRIS CAN KILL TWO STONES WITH ONE BIRD"
  },
  {
    "joke": "Chuck Norris invented roundhouse kicking season"
  },
  {
    "joke": "It is possible to contract hepatitis from smelling one of Chuck Norris's farts."
  },
  {
    "joke": "Chuck Norris can open an umbrella up your ass."
  },
  {
    "joke": "Chuck Norris uses his tongue can sniff out snakes. His tongue can also strangle a snake. He uses his beard to fillet the snake into bite size pieces and mixes it in with bananas to top off his bowl of Post Toasties."
  },
  {
    "joke": "When Chuck Norris makes cupcakes, the frosting on them is blood, just not his."
  },
  {
    "joke": "Chuck Norris uses Donald Trump's face for toilet paper. That's why he looks so shitty ugly and has Chuck Norris' golden shit smeared on his shit stained hair"
  },
  {
    "joke": "When Chuck Norris throws a ball, it crushes someone like a wrecking ball. I blame miley cyrus."
  },
  {
    "joke": "davie crocket may have killed a bear when he was 3. but Chuck Norris killed a pack of velociraptor's when he was 1"
  },
  {
    "joke": "Late at night, Chuck Norris was once walking back home alone after watching a Chuck Norris movie. A mugger approached him from the back, tapped on his shoulder and said \"Hey, gimme your money!\". Chuck Norris slowly turned around, paused for a while and gave the mugger a sarcastic smile. He then proceeded to rape the mugger anally, crush his skull, break his spine and killed him in a fraction of a second. Chuck Norris then brought the mugger back to life and then broke each of his limbs, eviscerated the mugger's gut, ate the mugger's still beating heart and infected him with AIDS, killing the unfortunate mugger once again. Chuck Norris then brough the mugger to life yet again for the second time, only to give the mugger a final fatal roundhous kick to his face killing the man and his soul at the same time. Chuck Norris then threw his packed wallet at the remains of his victim and said \"Do not tap on my shoulders ever again\", and continued to walk home slowly."
  },
  {
    "joke": "Chuck Norris owns the Elephant Man's skeleton, and recently aquired Michael Jackson's."
  },
  {
    "joke": "Chuck Norris' beard hair can be spun into gold. This is only in theory, for no one has, or will, ever touch Chuck's beard. EVER."
  },
  {
    "joke": "Jesus walked on water....Chuck Norris walked on Jesus"
  },
  {
    "joke": "Mr. T pities the fool. Chuck Norris rips the fool's head off."
  },
  {
    "joke": "when the grim reaper dies he sees Chuck Norris standing there telling him to\" come into the light\""
  },
  {
    "joke": "Ghost sit around the campfire and tell Chuck Norris stories"
  },
  {
    "joke": "As a toddler, little Chuck Norris would cut the paper into star shapes with a pair of hedge clippers."
  },
  {
    "joke": "Chuck Norris was pissed off because George Washington was president, so he called him a pussy and roundhouse kicked George to the face"
  },
  {
    "joke": "Chuck Norris won American idol using only sign language."
  },
  {
    "joke": "Chuck Norris doesn't do pushups. He does Earth-downs."
  },
  {
    "joke": "A child once got a Chuck Norris action figure for his b-day and he made the mistake of calling it a doll... he hasn't come out of the coma yet"
  },
  {
    "joke": "Chuck Norris' drumset has a cowbell with most of the cow still attached."
  },
  {
    "joke": "NASA ended the space shuttle program when they discovered it'd be easier and cheaper to have Chuck Norris launch astronauts into space."
  },
  {
    "joke": "People can swim on water but Chuck Norris can swim on Land"
  },
  {
    "joke": "Chuck Norris' treehouse has a basement."
  },
  {
    "joke": "Chuck Norris can shut a revolving door"
  },
  {
    "joke": "Chuck Norris has decided the value of Pi shall be 1, henceforth."
  },
  {
    "joke": "While having sex, Chuck Norris doesnt use a condom. Because there is no such thing as protection from Chuck Norris"
  },
  {
    "joke": "fool Chuck Norris once, shame on you, fool him twice, be extremely thankful he had some reason not to kill you the first time he let you think you fooled him"
  },
  {
    "joke": "When Chuck Norris makes cupcakes, the frosting on them is blood, just not his."
  },
  {
    "joke": "Chuck Norris invented the kangaroo when he ripped the front legs off a dog and threw it all the way to Australia."
  },
  {
    "joke": "Chuck Norris owns a playstation 360"
  },
  {
    "joke": "It's said that, when this website gets to Fact #9001, Chuck Norris will kick it in the URL, rocketing it up to 10,000 facts."
  },
  {
    "joke": "There is no Zool. Only Chuck Norris."
  },
  {
    "joke": "Calvin Klein always used to wear Chuck Norris' discarded slacks."
  },
  {
    "joke": "Chuck Norris once entered a drinking contest and one by drink everything in 1 second"
  },
  {
    "joke": "Chuck Norris keeps a boazooka and a gatling gun in his glove compartment."
  },
  {
    "joke": "Chuck Norris can literally HIT Puberty"
  },
  {
    "joke": "Chuck Norris commanded Russell Wilson to pass the ball instead of handing it off to Marshawn Lynch. Thats the reason why the Patriots won.........Seahawks should've won."
  },
  {
    "joke": "Chuck Norris takes Viagra to LOSE an erection."
  },
  {
    "joke": "Chuck Norris once got into a pissing match with a fire hose and won!"
  },
  {
    "joke": "Chuck Norris made Stevie Wonder flinch"
  },
  {
    "joke": "Chuck Norris' newest pet is a rocket pig. Chuck says the coolest thing about it is, if you ever get tired of flying your rocket pig, you can just turn it into bacon. Win, win!!"
  },
  {
    "joke": "Chuck norris eats 10 eggs daily."
  },
  {
    "joke": "President Reagan's \"Star Wars\" anti-missile plan was just a cover for his true idea to destroy incoming Soviet nukes: Chuck Norris in his backyard ready to shoot them down with his M-16. Secret tests showed that no missiles ever got past Chuck."
  },
  {
    "joke": "did u know Chuck Norris looks like he has red hair..... so all the people he has killed or beaten i just want to say that u got beat up by a GINGER."
  },
  {
    "joke": "Chuck Norris knows who shot J.R"
  },
  {
    "joke": "Effigies get burnt in Chuck Norris."
  },
  {
    "joke": "Chuck Norris once went to the Central Park Zoo in 1981. His favorite moment was teabagging the giraffes."
  },
  {
    "joke": "Chuck Norris doesn't push the envelope. He wipes his ass with it."
  },
  {
    "joke": "Chuck Norris' kindergarten has land-mines in the sandpit."
  },
  {
    "joke": "Christie Brinkley once swam through the Waco, TX sewer system just to see Chuck Norris' ass."
  },
  {
    "joke": "Chuck Norris, unlike Santa Clause, gives you a gift every day of the year. His gift is not roundhouse kicking you in the face."
  },
  {
    "joke": "Chuck Norris' father is Chuck Norris, his mother is America, his brother is freedom and his other brother is Sam... Sam Norris. Chuck Norris loves his family dearly, except for Sam, that is why Sam no longer exists."
  },
  {
    "joke": "When Chuck Norris dies, the world will end."
  },
  {
    "joke": "CHUCK NORRIS NEESDS TO USE A SEATBELT WHEN USING THE TOILET BECAUSE OF RECOIL!"
  },
  {
    "joke": "Chuck Norris can bake a cake by following the directions backwards."
  },
  {
    "joke": "When a biker falls while riding he gets a permanent case of road rash. When a ninja falls fighting Chuck Norris he gets a permanent case of Chuck rash."
  },
  {
    "joke": "If you ever make the mistake of confessing to Chuck Norris that you are a vegetarian, prepare to be immediately smothered to death by a slab of fresh veal."
  },
  {
    "joke": "Anti-deforestation laws prohibit complete listings of Chuck Norris' acomplishments on any paper based product."
  },
  {
    "joke": "Chuck Norris shits in urinals."
  },
  {
    "joke": "Chuck Norris can match the pwer packed taste of Sunny D."
  },
  {
    "joke": "Chuck Norris showed Snooki what the situation really is."
  },
  {
    "joke": "The Bill Of Rights was written by Chuck Norris on a used napkin and was originally called The Chuck Of Wrongs."
  },
  {
    "joke": "Archeologists unearthed an old english dictionary dating back to the year 1236. It defined \"victim\" as \"one who has encountered Chuck Norris\""
  },
  {
    "joke": "The Great Wall of China was originally created to keep Chuck Norris out. It failed miserably."
  },
  {
    "joke": "ONLY REASON WHY JUSTIN BIEBER IS ALIVE IS BECAUSE CHUCK NORRIS IS HOMOPHOBIC"
  },
  {
    "joke": "When david belfirst first invented the telephone there were 2 missed calls from Chuck Norris."
  },
  {
    "joke": "Chuck Norris has six testicles. They surround his penis like the cylinder of a revolver."
  },
  {
    "joke": "Chuck Norris likes to force-feed Navy SEALs fish."
  },
  {
    "joke": "Chuck Norris has his Budweiser shaken, not stirred."
  },
  {
    "joke": "Chuck Norris is So Badass, he went to the island of Coradie to kick Ganon's Ass."
  },
  {
    "joke": "Chuck Norris' father is The Most Interesting Man in the World of Dos Equis fame, and his grandfather was Teddy Roosevelt."
  },
  {
    "joke": "Chuck Norris doesn't 'pass gas' he FARTS and blows trees over!"
  },
  {
    "joke": "Chuck Norris doesn't drink tea - he drinks hot beer"
  },
  {
    "joke": "Chuck Norris created ninjas."
  },
  {
    "joke": "This site has the worst Chuck Norris jokes out there. I mean really people. No one even puts any thought into them. They are pathetic"
  },
  {
    "joke": "Chuck Norris is by far the most violent man to ever win the Nobel peace prize."
  },
  {
    "joke": "Chuck Norris once pissed in a man's beer bottle and made him drink it. That man is now known as \"the most intersting man in the world\"."
  },
  {
    "joke": "\"Like a good neighbor...\" Chuck Norris is there... with a roundhouse kick to the face."
  },
  {
    "joke": "Chuck Norris rammed a gold watch up Christopher Walken's ass."
  },
  {
    "joke": "Nothing can escape the gravity of a black hole, except for Chuck Norris. Chuck Norris eats black holes. They taste like chicken."
  },
  {
    "joke": "Stevie Wonder can see what a badass Chuck Norris is."
  },
  {
    "joke": "Chuck Norris enjoys plucking chickens while skydiving."
  },
  {
    "joke": "Chuck Norris can sell pornography to a blind man."
  },
  {
    "joke": "Chuck Norris owns the world's only working proton pack. He has used it once, to kill some noisy neighbours, then catch their souls."
  },
  {
    "joke": "If you give a man a fish, he will eat for a day. If you give Chuck Norris a fish, he will kill you with it."
  },
  {
    "joke": "Did you know that Chuck Norris invented the color black, in fact he invented the whole spectrum of colors.....except pink. Tom Cruise invented pink."
  },
  {
    "joke": "Chuck Norris once flipped a coin getting both heads and tails at the same time."
  },
  {
    "joke": "Chuck Norris went out of an infinite loop."
  },
  {
    "joke": "Chuck Norris' derringer can fire a 30 round clip of 12 ga rifled slugs."
  },
  {
    "joke": "Chuck Norris can choose his friends... his neighbors... his parents and family."
  },
  {
    "joke": "When most people think of \"bone china,\" they think of flatware.  Chuck Norris is reminded of the three weeks he spent sampling the best whorehouses in Hong Kong back in '78."
  },
  {
    "joke": "The most obvious upside to receiving a brutal Chuck Norris roundhouse kick is is that you will enter the afterlife knowing that you have died the most awesome death possible."
  },
  {
    "joke": "Chuck Norris once ate a banana and then defecated a gainomax recovery drink package...that is how gainomax is made"
  },
  {
    "joke": "Michael Jackson once met Chuck Norris. That night, he went home and wrote \"Thriller\""
  },
  {
    "joke": "chuck Norris is the last # in pi and that's why nobody has found it, cause you don't find chuck Norris... he find's... hold on i hear the door bell"
  },
  {
    "joke": "Chuck Norris can stack cups without moving his hands or eyes."
  },
  {
    "joke": "God prays to Chuck Norris"
  },
  {
    "joke": "If you ever have to go to prison, get \"property of Chuck Norris\" tattooed on your body and you can drop the soap with no fear."
  },
  {
    "joke": "Chuck Norris can play Angry Birds from a payphone..."
  },
  {
    "joke": "the first thing Chuck Norris said wen he was born was ..... i hate corey"
  },
  {
    "joke": "The last person smart-off to Chuck Norris found himself picking up his teeth with two broken arms and counting them with two black eyes."
  },
  {
    "joke": "If Her Royal Highness, Queen Elizabeth of England were to marry Chuck Norris, her official Royal title would be elevated to that of: \"Liz Norris, Chuck's Bitchy Royal Slut of a Wife\"."
  },
  {
    "joke": "We all need somebody to lean on. Except for CHuck Norris."
  },
  {
    "joke": "Chuck Norris eats tree leafs and shits 100 dollar bills."
  },
  {
    "joke": "The Missing Link IS Chuck Norris."
  },
  {
    "joke": "Chuck Norris killed the Dead Sea, and painted the Red Sea with its blood."
  },
  {
    "joke": "the idea for the movie SAW was based off of the accounts of people who went into Chuck Norris' room when he was a kid."
  },
  {
    "joke": "Chuck Norris don't wait for Santa Clause,Santa Clause waits for Chuck Norris."
  },
  {
    "joke": "a black hole is not created when a star dies, it is created when a star gets round-house kicked by Chuck Norris"
  },
  {
    "joke": "A semi-tanker truck once accidently spilled 30,000 gallons of petroleum jelly on I-35 in Texas. A schoolbus load of unsuspecting cheerleaders then got rear-ended by Chuck Norris."
  },
  {
    "joke": "Chuck Norris can disembowel a sandstorm with a roundhouse kick."
  },
  {
    "joke": "If it looks like chicken, tastes like chicken, and feels like chicken but Chuck Norris says its beef, then it's fucking beef."
  },
  {
    "joke": "Chuck Norris can make hamburger out of ham."
  },
  {
    "joke": "Freddy fazbear and his friends dont scare Chuck Norris.....Chuck norris beats up Freddy and his friends."
  },
  {
    "joke": "Chuck Norris wipes his ass with various non-American flags."
  },
  {
    "joke": "Chuck Norris knows the last number in Pie"
  },
  {
    "joke": "Chuck Norris was born :December 32nd"
  },
  {
    "joke": "It is considered a great accomplishment to go down Niagara Falls in a wooden barrel. Chuck Norris can go up Niagara Falls in a cardboard box."
  },
  {
    "joke": "The Marquis de Sade invented wrought iron testicle clamps. Chuck Norris univented them which is why you've never heard of them before. Chuck Norris prefers to destroy your balls with a roundhouse kick."
  },
  {
    "joke": "Chuck Norris uses ribbed condoms inside out, so he gets the pleasure."
  },
  {
    "joke": "Little known fact: Chuck Norris shot J.R. after he killed him with a spectacular roundhouse kick to the forehead."
  },
  {
    "joke": "Genesis 32:30- I have seen the face of God Chuck Norris 1:1- I punched the shit out of it"
  },
  {
    "joke": "South American tribesmen coat their blowdart tips in Chuck Norris' sweat."
  },
  {
    "joke": "If you find Chuck Norris while playing hide and seek, you lose."
  },
  {
    "joke": "Chuck Norris can play Bach's Goldberg Variations on sitar, whilst accompanying himself on didgereedoo."
  },
  {
    "joke": "Some people look for religion, religion looks for Chuck Norris"
  },
  {
    "joke": "Chuck Norris can login without signing up, on any website."
  },
  {
    "joke": "I WANT TO CHOP CHUCK NORRIS IN HALF I WANNA KILL HIM"
  },
  {
    "joke": "In a single day in 1967, Chuck Norris shot down 22 enemy aircraft over Vietnam. He was stationed in Greenland at the time."
  },
  {
    "joke": "It's been discovered that the best possible weapon to have when the zombies come is Chuck Norris."
  },
  {
    "joke": "Chuck Norris once fed a cannibal with a knuckle sandwich."
  },
  {
    "joke": "Chuck Norris doesnt believe in religion, religion believes in Chuck Norris"
  },
  {
    "joke": "In a paper due out soon, Stephen Hawking has proven that Chuck Norris exists in every universe, multiverse, and every dimension. There is no escaping Chuck Norris."
  },
  {
    "joke": "Before Chuck Norris was born, the martial arts weapons with two wooden rods attached to a chain were originally called Nunwaldos. Nobody knows what happened to Waldo but they are still looking for him."
  },
  {
    "joke": "Chuck Norris was featured on wheel of fortune all people did for the past 30 minutes was stare at a wheel not stopping"
  },
  {
    "joke": "Chuck Norris will find you and he will kill you gatlin"
  },
  {
    "joke": "Chuck Norris can watch DVDs in a VCR player."
  },
  {
    "joke": "Whwn steaming clams, Chuck Norris boils the water by dipping his testicles into the pot. This of course also gives the clams their incredible flavor."
  },
  {
    "joke": "After watching the movie 'Titanic', Chuck Norris had tears in his eyes. Tears of laughter."
  },
  {
    "joke": "When Chuck Norris takes a crap this is what's called an earthquake."
  },
  {
    "joke": "Chuck Norris had a confirmed kill count of over 50 by his third birthday."
  },
  {
    "joke": "Chuck Norris once farted and lit it on fire as a joke. We now call it the sun."
  },
  {
    "joke": "Inspired by Robert De Niro in Taxi Driver, Chuck Norris always keeps two spring-out M16s up the sleeves of his jackets."
  },
  {
    "joke": "Chuck Norris smashed microsofsts window"
  },
  {
    "joke": "meteors, there is no such thing those are the victims that being roundhouse kicked by Chuck Norris"
  },
  {
    "joke": "Chuck Norris once took his pet Sasquatch to a Furry Convention."
  },
  {
    "joke": "Chuck Norris does not find spicy foods hot. Spicy foods find Chuck Norris hot."
  },
  {
    "joke": "Chuck Norris personally trained his pet canary for a daily early morning free flight excercise in the great outdoors. It usually returns for breakfast carrying a dead peregrine falcon in it's beak."
  },
  {
    "joke": "Chuck Norris was asked if he would date Rosie O'Donnell? Chuck said \"I'd rather shove a lit match up my pee-hole\"."
  },
  {
    "joke": "When Chuck Norris was little, his friends had pet Goldfish. Chuck had a pet Piranha."
  },
  {
    "joke": "Chuck Norris won the 2011 Texas Holdem championship by bluffing the last hand while his down cards were the Joker & the Old Maid."
  },
  {
    "joke": "Most people wear Superman pajamas. Superman wears Chuck Norris pajamas."
  },
  {
    "joke": "The quick brown fox jumped over the lazy dog. They both were then shot and skinned by Chuck Norris."
  },
  {
    "joke": "When Chuck Norris typed \"LMAO\" on the internet, he actually did it."
  },
  {
    "joke": "Chuck Norris built a better mousetrap, but the world was too frightened to beat a path to his door."
  },
  {
    "joke": "Chuck norris can logon to a windows desktop without pressing ctrl+alt+delete!"
  },
  {
    "joke": "The upcoming Blade Runner: Definitive Edition has a newly-restored voice-over narration by Chuck Norris"
  },
  {
    "joke": "Chuck Norris once ejaculated for forty-five minutes straight."
  },
  {
    "joke": "Chuck Norris can kill a Shaolin Grandmaster with an Icecream."
  },
  {
    "joke": "Chuck Norris can bungee jump without a rope"
  },
  {
    "joke": "Only a very few people are capable of water skiing on thier barefeet. Chuck Norris can water ski on his bare face."
  },
  {
    "joke": "While playing his 1982 vintage Atari Asteroids game, Chuck Norris discovered & unlocked 3 easter eggs revealing a new multi-weapon pointer, the original Doom beta and the GPS coordinates for The Lost Ark of the Covenant."
  },
  {
    "joke": "While playing Rock Band, Chuck Norris can play air drums and still hit the notes. Going into overdrive without telling him, he instantly gives you a round house kick to the face."
  },
  {
    "joke": "Little Miss Muffet sat on her tuffet, until Chuck Norris roundhouse kicked her into a glacier."
  },
  {
    "joke": "Superman is based off of Chuck Norris: They both are unstoppable."
  },
  {
    "joke": "Chuck Norris is so tough you could sharpen a knife just by holding it in the air next to his face."
  },
  {
    "joke": "\"Fear is the sustenance that need not be chewed.\" -Chuck Norris"
  },
  {
    "joke": "Aliens are too afraid to visit Earth because they're afraid they'll get probed by Chuck Norris."
  },
  {
    "joke": "as a kid Chuck Norris beat the hell out of 1 of the beatles. next time dont piss him off."
  },
  {
    "joke": "Chuck Norris has decided the value of Pi shall be 1, henceforth."
  },
  {
    "joke": "A man walks up to Chuck Norris and ask for a lite...May he rest in peace."
  },
  {
    "joke": "It is believed dinosaurs are extinct due to a giant meteor. That's true if you want to call Chuck Norris a giant meteor."
  },
  {
    "joke": "Entropy in the universe increases one billion fold, after every roundhouse kick by Chuck Norris."
  },
  {
    "joke": "Cannibals worship King Kong. King Kong worships Chuck Norris."
  },
  {
    "joke": "Chuck Norris once fed a cannibal with a knuckle sandwich."
  },
  {
    "joke": "Chuck Norris has enough bling to make Mr. T look Amish"
  },
  {
    "joke": "No matter where Chuck Norris is, he always gets free wifi and a full bar cell-phone reception"
  },
  {
    "joke": "Z0mg CHUCK NORRIS ROXORZ!!!!111 one one 111!!!!"
  },
  {
    "joke": "Chuck Norris once milked a honey badger."
  },
  {
    "joke": "Chuck Norris can rob a bank with a squirt gun."
  },
  {
    "joke": "When Chuck Norris farts in an elevator, all the other passengers hold their breath and say \"good one, Chuck\"!"
  },
  {
    "joke": "Jean-Claude Van Damme once attempted to throw a Chuck Norris Roundhouse Kick. He was immediately arrested for fraud."
  },
  {
    "joke": "Chuck Norris enough said"
  },
  {
    "joke": "Chuck Norris doesn't go to the gas station. Chuck Norris goes to Jurassic Park."
  },
  {
    "joke": "If Chuck Norris was anti-social, the world would be a very dangerous place."
  },
  {
    "joke": "All arrays Chuck Norris declares are of infinite size, because Chuck Norris knows no bounds."
  },
  {
    "joke": "No one invented superman, it was just a rip-off of Chuck Norris."
  },
  {
    "joke": "God comes over to Chuck Norrises house to borrow sugar"
  },
  {
    "joke": "Meteors are actually people blazing down to Earth after having been roundhouse kicked by Chuck Norris into space for telling bad jokes about him."
  },
  {
    "joke": "When Chuck Norris recycles paper it turns right back into trees"
  },
  {
    "joke": "Chuck Norris has only one fear...that's why there are no mirrors in his house"
  },
  {
    "joke": "Chuck Norris was once in a hardware store, when somebody brushed past him and didn't immedaitely apologize. Chuck prompty grabed a nailgun and turned the asshole into Pinhead."
  },
  {
    "joke": "Chuck Norris likes his coffee half and half: half coffee grounds, half wood-grain alcohol."
  },
  {
    "joke": "If Chuck Norris told YOU to jump off a bridge, you should thank him profusely and do it immediately."
  },
  {
    "joke": "Chuck Norris can make a movie with 75 cents and a dirty look."
  },
  {
    "joke": "Chuck Norris explains, his daily swim across the Pacific is the reason why he is so fit."
  },
  {
    "joke": "There is a Chuck Norris fact number zero, but those who read it will get blind because that was Chuck Norrir's first created by Chuck Norris himself."
  },
  {
    "joke": "Chuck Norris doesn't get constipated, he holds his shit for ransom"
  },
  {
    "joke": "Chuck Norris roundhouse-kicked the nose off of the Sphinx."
  },
  {
    "joke": "Chuck Norris once ate an entire bottle of sleeping pills. They made him blink."
  },
  {
    "joke": "Mick Jagger: \"oh you can't always get what you waaaannt.\"  Chuck Norris \"Yes I can.\""
  },
  {
    "joke": "You know how they say if you die in your dream then you will die in real life? In actuality, if you dream of death then Chuck Norris will find you and kill you."
  },
  {
    "joke": "Chuck Norris can alter his DNA so his spawn can go about undetected in the world. So remember that - even if your kid looks and acts just like you, he might still be one of Chuck's, and you will never know until he turns four and runs you over in your own car."
  },
  {
    "joke": "In America, Chuck Norris can beat you up. In Soviet Russia, Chuck Norris can beat you up."
  },
  {
    "joke": "Who watches the Watchmen? Chuck Norris."
  },
  {
    "joke": "Chuck Norris  ) Plz vote facts 1063-1067 as high as you can"
  },
  {
    "joke": "Why do extraterrestial travelers visit Earth? To worship Chuck Norris."
  },
  {
    "joke": "Read! its what smart people do! but not Chuck Norris. He already is smart enough."
  },
  {
    "joke": "life < existence < Infinite power < God < Chuck Norris."
  },
  {
    "joke": "In 1508, Chuck Norris threw a tin of paint at a ceiling, ever since then thousands of people flock to see the Sistine Chapel."
  },
  {
    "joke": "Oxygen requires Chuck Norris to live"
  },
  {
    "joke": "Chuck Norris regularly breaks into the White House, just to scare the shit outta Barack."
  },
  {
    "joke": "All of Chuck Norris' chinese ex-girlfriends say \"chuck can fuck\" but it didnt work out because \"chuck ig-nore-us\""
  },
  {
    "joke": "Tiffany has breakfast at Chuck Norris's."
  },
  {
    "joke": "Chuck Norris can slice fries with his beard. He then stares at them until they are Golden Brown."
  },
  {
    "joke": "When you yell Chuck Norris out a window, he can hear you. But when you yell out Bloody Mary, he finds and kills you."
  },
  {
    "joke": "Chuck Norris' fairy godparents do not use \"Da Rules book\". He can wish for anything he wants no matter if its bad or not."
  },
  {
    "joke": "Chuck Norris end of story"
  },
  {
    "joke": "Chuck Norris can kick you in the nuts so hard, they will fly through your body up into your head and knock out your eyeballs, effectively replacing them."
  },
  {
    "joke": "Chuck Norris uses his pet guinea pig, Whiskers, to hunt mountain lions."
  },
  {
    "joke": "When Steven Seagal kills a ninja, he only takes its hide. When Chuck Norris kills a ninja, he uses every part."
  },
  {
    "joke": "Harper Lee's classic novel's original title: 'To Kill A Mockingbird, Simply Tell Chuck Norris It Shat On His Ferrari'"
  },
  {
    "joke": "Satan himself is a massive Chuck Norris fan, but Chuck made him member #777 just to piss him off."
  },
  {
    "joke": "Robocops' four prime directives: 1-Serve the public trust. 2-Protect the innocent. 3-Uphold the law. 4-Chuck Norris."
  },
  {
    "joke": "Pandora opened the box and saw Chuck norris"
  },
  {
    "joke": "Chuck Norris REALLY went back to the future."
  },
  {
    "joke": "It is considered a great accomplishment to go down Niagara Falls in a wooden barrel. Chuck Norris can go up Niagara Falls in a cardboard box."
  },
  {
    "joke": "Chuck norris eats 10 eggs daily."
  },
  {
    "joke": "A reporter asked Chuck Norris what he thought when the news runs a story about the Kardashians. Chuck said \"I think that's a good time to take a big dump\"."
  },
  {
    "joke": "Every time Chuck Norris leaves a room, the song \"There Goes My Hero\" starts playing out of nowhere."
  },
  {
    "joke": "Chuck Norris is so fast that he can use the earths rotation as a tredmill."
  },
  {
    "joke": "You know... Chuck Norris KNOWS Victoria's Secret... when he looks in the mirror his reflection runs away   Probably his greatest accomplishment:   He once round-house kicked someone so far his ody went back through time and hit Amelia Airheart's plane and it was shot down over the Pacific Ocean"
  },
  {
    "joke": "Chuck Norris went to court once, and he lost. He roundhouse kicked the judge in the head so hard that all of justice became blind."
  },
  {
    "joke": "Chuck Norris choked Kim Jong-Il to death with some spicy cabbage."
  },
  {
    "joke": "Chuck Norris saw a dick on TV1000!"
  },
  {
    "joke": "Chuck Norris can kill more people before 9 A.M. than most armies can kill all day."
  },
  {
    "joke": "Chuck Norris is personally responsible for global warming, but it seems no one can convince him to go on a diet who actually lived to tell us if he would consider lightening his daily intake of barbecued rattlesnakes and beans."
  },
  {
    "joke": "Chuck Norris ordered a Big Mac at Burger King, and got one."
  },
  {
    "joke": "Chuck Norris haunts Freddy Krueger's dreams."
  },
  {
    "joke": "If it bleeds, we can kill it. Therefore, Chuck Norris cannot bleed."
  },
  {
    "joke": "Chuck Norris has X-Ray vision. And damn right, he does use it to see through hot women's clothes."
  },
  {
    "joke": "Chuck Norris doesn't go to the gas station. Chuck Norris goes to Jurassic Park."
  },
  {
    "joke": "Chuck Norris jizzes lightning bolts."
  },
  {
    "joke": "Chuck Norris likes lots of honey on his Texas Toast. That's why he keeps 27 killer bee hives in his livingroom."
  },
  {
    "joke": "Chuck Norris doesn't need to shower, he dares dirt to touch him..."
  },
  {
    "joke": "when Chuck Norris plays madden 2012 he plays on all-chuck"
  },
  {
    "joke": "Chuck Norris was pissed off because George Washington was president, so he called him a pussy and roundhouse kicked George to the face"
  },
  {
    "joke": "CHUCK NORRIS is your daddy"
  },
  {
    "joke": "Chuck Norris was only played in scenes of the movie Expendables 2 because all of the action scenes compiled would only last 17 seconds."
  },
  {
    "joke": "Chuck Norris can snatch your wife's golden watch in far less time than it takes a Peeping Tom to watch your wife's golden snatch!"
  },
  {
    "joke": "Chuck norris can copy/paste the text from a captcha."
  },
  {
    "joke": "Before Chuck Norris came along, pitbulls were lap dogs."
  },
  {
    "joke": "Chuck Norris banged the tooth fairy."
  },
  {
    "joke": "Chuck Norris choked Kim Jong-Il to death with some spicy cabbage."
  },
  {
    "joke": "On the morning of July 30, 1975, Jimmy Hoffa scratched Chuck Norris' truck. Hoffa vanished later that day.  Let this be a lesson for all."
  },
  {
    "joke": "Chuck Norris catches the bus one handed."
  },
  {
    "joke": "Chuck Norris wears boxer shorts made from barbed wire."
  },
  {
    "joke": "Knock...Knock. \"Who's there?\" (Door crashes into room, building collapses, mushroom cloud) \"Chuck Norris.\""
  },
  {
    "joke": "In the time it takes you to read this sentence, chuck Norris will free two hundred POW's from a Vietnamese prison camp, roundhouse kick Saturn, and expose a dozen lucky women to a love so intense that they will be incinerated."
  },
  {
    "joke": "Chuck Norris was in a bear fight, he tapped the bear with his finger and the bear fainted and died"
  },
  {
    "joke": "Chuck Norris solved the Travelling Salesman problem in O(1) time. Here's the pseudo-code: Break salesman into N pieces. Kick each piece to a different city."
  },
  {
    "joke": "When the first man whent to the moon Chuck norris had already had a pic nic there twice."
  },
  {
    "joke": "Chuck Norris does not sleep. He waits."
  },
  {
    "joke": "Police label anyone attacking Chuck Norris as a Code 45-11.... A suicide."
  },
  {
    "joke": "There's no such thing as global warming. Chuck Norris just got cold, so he turned up the sun."
  },
  {
    "joke": "When Chuck Norris receives oral sex, the woman always orgasms first."
  },
  {
    "joke": "If everything seems to be going well, you have obviously overlooked Chuck Norris"
  },
  {
    "joke": "The easiest way to determine Chuck Norris' age is to cut him in half and count the rings."
  },
  {
    "joke": "Chuck Norris can fly submerines"
  },
  {
    "joke": "Chuck Norris speaks every language on Earth, and three more that no one else speaks."
  },
  {
    "joke": "Any conservitive estimate of the amount of presents Chuck Norris has received each year for Christmas is still in the billions."
  },
  {
    "joke": "A study showed the leading causes of death in the United States are: 1. Heart disease, 2. Chuck Norris, 3. Cancer"
  },
  {
    "joke": "Chuck Norris does not kill you; your already dead when you see him."
  },
  {
    "joke": "Chuck Norris invented the olympic games. with his left pinky."
  },
  {
    "joke": "Chuck Norris once punched a man so hard in his mouth that the only thing that came out of the man's penis for 3 weeks was teeth"
  },
  {
    "joke": "Chuck Norris has never made the same mistake twice because if he made a mistake and didn't actually kill you the first time, he'll go back in time and actually kill you 2 minutes before he tried to the first time."
  },
  {
    "joke": "Chuck Norris getting his ass kicked is as likely as seeing a vampire with a suntan."
  },
  {
    "joke": "Chuck Norris can tow a 28 foot boat with his Volkswagen Bug."
  },
  {
    "joke": "Chuck Norris always carries a ice cooler around with him so he can store severed hands of people who where brave enough to shake his hand"
  },
  {
    "joke": "Chuck Norris really wants to hurt Boy George."
  },
  {
    "joke": "Chuck Norris doesn't get called for jury duty.  He gets called on to act as executioner."
  },
  {
    "joke": "\"Welcome to the jungle\" starts playing out of nowhere whenever a dr starts giving Chuck Norris a colonoscopy"
  },
  {
    "joke": "Arnold Schwarzenegger says \"I'll be back!\". Chuck Norris says \"I'm back!\""
  },
  {
    "joke": "Chuck Norris completed the Tough Guy Challenge by doing nothing."
  },
  {
    "joke": "Chuck Norris fought the Law and Chuck won. No law can hold back Chuck Norris."
  },
  {
    "joke": "When Chuck Norris goes to donate blood, he declines the syringe, and instead requests a hand gun and a bucket."
  },
  {
    "joke": "Chuck Norris sensed a great disturbance in the force. Then he laughed, because he realised it was himself."
  },
  {
    "joke": "When Chuck Norris first laid eyes on you, you were already dead"
  },
  {
    "joke": "Someone once videotaped Chuck Norris getting pissed off. It was called Walker: Texas Chain Saw Masacre."
  },
  {
    "joke": "Chuck Norris once won a D 1 Drifting Championship by driving a smart car with no motor,tranny,wheels or tires...come to think of it he was merely running sidways while making scretching noises"
  },
  {
    "joke": "Chuck Norris grinds black pepper with his ass-cheeks."
  },
  {
    "joke": "Chuck Norris can score a hole in zero in golf."
  },
  {
    "joke": "Chuck Norris once rolled a 13 at the craps table."
  },
  {
    "joke": "Chuck Norris lets lightning hit him sometimes--it tickles."
  },
  {
    "joke": "Chuck Norris can touch MC Hammer"
  },
  {
    "joke": "Alcohol only makes Chuck Norris a stronger, louder, more efficient American killing machine."
  },
  {
    "joke": "Most atheists agree that Chuck Norris is God's gift to mankind"
  },
  {
    "joke": "9 out of the last 10 women that had sex with Chuck Norris died from lethal injection. The other one died from throbbing penal asphyxiation."
  },
  {
    "joke": "When The Four Horseman of the Apocalypse entered this world, the first person they met was Chuck Norris. They now bunk at his horse ranch in Texas and clean the manure from the stables every morning."
  },
  {
    "joke": "Chuck Norris taught spongebob how to make a camp fire. Underwater."
  },
  {
    "joke": "Chuck Norris can walk a tight rope upsidedown."
  },
  {
    "joke": "Once when Chuck Norris was a child.....who are we kidding, Chuck Norris was born a man"
  },
  {
    "joke": "once Chunk norris got a wireless box and as a result never piss Chuck Norris"
  },
  {
    "joke": "When Chuck Norris talks, everybody listens. And dies."
  },
  {
    "joke": "Chuck Norris can clip his toenails, blow up a balloon, sneeze and inhale a cigarette at the same time."
  },
  {
    "joke": "Chuck Norris can write the entire Declaration of Independence on his penis...with a paint roller."
  },
  {
    "joke": "if someone challenges Chuck Norris, life ends on earth"
  },
  {
    "joke": "Chuck Norris ate Hannibal Lecter"
  },
  {
    "joke": "If he wanted to, Chuck Norris could roundhouse kick you in the face with the ingrown hair on his ass even tho' he doesn't have one."
  },
  {
    "joke": "Chuck Norris took the red pill, the blue pill, 4 horse tranquilizers and a handful of rat poison, washed it down with a bottle of bourbon, and roundhouse kicked Morpheus out of the Matrix. Norris then unplugged himself out ofthe Matrix by simply flexing, broke into Zion and roundhouse kicked Morpheus again, just because he's Chuck Norris."
  },
  {
    "joke": "Chuck Norris toilet is made of stainless steel."
  },
  {
    "joke": "Chuck Norris wasn't born, he just got tired of wearing his mother."
  },
  {
    "joke": "Chuck Norris Gave Santa a box full of Condoms on Christmas day last year."
  },
  {
    "joke": "Jesus wears a WWCND (what would Chuck Norris do) bracelet."
  },
  {
    "joke": "It's been discovered that the best possible weapon to have when the zombies come is Chuck Norris."
  },
  {
    "joke": "Chuck Norris' e-mail Yahoo@chucknorris.com"
  },
  {
    "joke": "Once, while dining in a fancy New York restaurant, Chuck Norris discovered a fly in his soup. There were no survivors."
  },
  {
    "joke": "After Chuck Norris takes a dump, he sprays his bathroom with a can of Glade Floral Spray. That helps and makes it only smell like a hippopotamus took a shit in a flower garden."
  },
  {
    "joke": "Jesus wears a WWCND (what would Chuck Norris do) bracelet."
  },
  {
    "joke": "We're taught Jesus died for the redemption of our sins: past, present and future. If Chuck Norris sins, we're totally screwed. We'll need a bus full of Jesuses, for something as minor as when Chuck Norris says \"God dammit\"."
  },
  {
    "joke": "Dos Equis' \"most interesting man in the worls\" asks Chuck Norris for advice"
  },
  {
    "joke": "Chuck Norris can whistle \"Dixie\" in reverse."
  },
  {
    "joke": "freddie crougar once impersonated Chuck Norris and that is the reason why we have nightmares"
  },
  {
    "joke": "Life is like a box of chocolates until Chuck Norris roundhouse kicks you."
  },
  {
    "joke": "You must always pay attention while driving, in case you are distracted for a split second and Chuck Norris drop-kicks a midget through your windscreen"
  },
  {
    "joke": "Chuck Norris is James Bond's wingman."
  },
  {
    "joke": "God help anyone who attends a Chuck Norris poetry slam."
  },
  {
    "joke": "Chuck Norris is SWAGG!"
  },
  {
    "joke": "If you see Chuck Norris and your heart stops, you're one of the lucky ones."
  },
  {
    "joke": "Chuck Norris's favorite word? CHORUS."
  },
  {
    "joke": "Chuck Norris can ignore the call of nature for 36 hours, but he can never ignore the call of duty."
  },
  {
    "joke": "Chuck Norris' first car was a Caterpillar D9."
  },
  {
    "joke": "Chuck Norris knows more about propaganda then Noam Chomsky."
  },
  {
    "joke": "Chuck norris does'nt use a gun he pionts his finger and says \"Pow\""
  },
  {
    "joke": "Chuck Norris coughs up more daily hairballs than a dozen house cats strictly due to the volume of his daily muff-diving requests."
  },
  {
    "joke": "if chuck Norris stared on the movie \"taken\" the movie would have been called \"given back questions asked\""
  },
  {
    "joke": "Chuck Norris built a time machine and went back in time to stop the JFK assassination. As Oswald shot, Chuck Norris met all three bullets with his beard, deflecting them. JFK's head exploded out of sheer amazement."
  },
  {
    "joke": "Chuck Norris won the first americas got talent by just saying his name."
  },
  {
    "joke": "President Bush DID have a sure fire plan to end the war in Iraq, However Chuck Norris was busy that day."
  },
  {
    "joke": "Chuck Norris and Mr. T walked into a bar. The bar was instantly destroyed, as that level of awesome cannot be contained in one building."
  },
  {
    "joke": "Chuck Norris doesn't need to eat. He runs on the fear of his enemies."
  },
  {
    "joke": "NASA scientists concur prolonged visual exposure to Chuck Norris can result in: blindness, nausea, and partial paralysis."
  },
  {
    "joke": "Chuck Norris has been using your wife's twat as a sperm dumpster."
  },
  {
    "joke": "Chuck Norris donates all of his money to the M.Y. Wallet foundation, and you better too, or else."
  },
  {
    "joke": "Chuck Norris invented beef jerky by throwing a bull through a chain-link fence."
  },
  {
    "joke": "Big Foot takes plaster molds of Chuck Norris' footprints"
  },
  {
    "joke": "They say Bruce Lee died in an accident...but it is the fact you don't kick Chuck Norris' ass without consequence!"
  },
  {
    "joke": "Chuck Norris has the mind of an Industrial Engineer. Every Sunday after church Chuck Norris picks-up a barrel of extra crispy KFC and a DQ shake from the McDonalds drive-thru. Why? Because nobody denies Chuck Norris anything and McDonalds is closer to his house than Taco Bell."
  },
  {
    "joke": "Chuck Norris can play slide guitar with a beer bottle. Or, failing that, your face."
  },
  {
    "joke": "Chuck Norris can beat the Dark Souls video game in one play through without dying."
  },
  {
    "joke": "There is space, there is time, and there is Chuck Norris. Just kidding, Chuck came first."
  },
  {
    "joke": "Chuck Norris killed godzilla in his dream"
  },
  {
    "joke": "Chuck Norris' idea of a relaxing evening stroll is walking through East Detroit at midnight."
  },
  {
    "joke": "Aliens do exist. They're just waiting for Chuck Norris to die before they attack."
  },
  {
    "joke": "Chuck Norris once frightened Christopher Walken. From now on he is known as Christopher Runnin."
  },
  {
    "joke": "Chuck Norris doesn't read books. He stares them down until he gets the information he wants."
  },
  {
    "joke": "Chuck Norris roasts marshmallows by holding them near his groin for less than 30 seconds."
  },
  {
    "joke": "Chuck Norris is Strong Enough for a Man, But Made For a Woman."
  },
  {
    "joke": "The quickest way to a man's heart is with Chuck Norris' fist."
  },
  {
    "joke": "Chuck Norris can take a bath in a toilet."
  },
  {
    "joke": "Chuck Norris stomped on King Kong. After that, King Kong became Alvin Seville."
  },
  {
    "joke": "Chuck Norris ordered a Big Mac at KFC. He got one."
  },
  {
    "joke": "Chuck norris once gave his grandma a ball of steal wool and she knitted him a bmx.."
  },
  {
    "joke": "Chuck Norris loves the smell of burning human flesh. He also loves the the sound of bones cracking, the sight of Navy SEALs crying, the feel of a good, heavy pump-action in his hands, and the taste of virginity."
  },
  {
    "joke": "The back of Chuck Norris' hands are always speckled with bone marrow."
  },
  {
    "joke": "Which came first - the chicken or the egg? Chuck Norris said it was the beer which came first, the hell with these damn animals!!!"
  },
  {
    "joke": "A panel of 5 judges survived after allowing a young Chuck Norris to win his 5th grade spelling bee by correctly spelling the word \"Encyclopedia\" as b,o,o,k."
  },
  {
    "joke": "Chuck Norris has a picture of himself standing in the Grand Canyon, shirtless, oiled up and holding two sub-machineguns, and surrounded by naked ladies on his passport photo."
  },
  {
    "joke": "Chuck Norris once ran 3857689753872893687 kilometers in 0.000000001 seconds in wet cement while pulling a 783769718-wheeler truck full of 75939284869686 cubic meters of very heavy objects. [insert the phrase \"over 9000!\" many times here, please]"
  },
  {
    "joke": "Chuck Norris has concealed weapons permits, so he can wear gloves."
  },
  {
    "joke": "Chuck norris can litrely break a sweet"
  },
  {
    "joke": "Chuck Norris won the 2014 Pulitzer Prize for his 874 page short story called \"Me, Chuck Norris\"."
  },
  {
    "joke": "Chuck Norris doesn't call a doctor for erections that last for over 4 hours. But the sluts he bangs need to."
  },
  {
    "joke": "All bad guys ever kicked by Chuck Norris in TV/movies immediatly died upon end of contract. Chuck Norris respects the Law."
  },
  {
    "joke": "Knock knock. Whos there? Chuck Norris. Chuck Norris who? Chuck Norris is gonna roundhouse kick ya in the FACE"
  },
  {
    "joke": "The moon has craters on it cos once Chuck Norris had sex with it and gave it syphilis - and small pox"
  },
  {
    "joke": "Chuck Norris can count the ABC"
  },
  {
    "joke": "The only way you can die is by Chuck Norris. If you're about to die by something else, he'll kill you a nanosecond beforehand."
  },
  {
    "joke": "When Chuck Norris kicks you in the face, you know you're dead. When he kicks himself in the face, he knows he's alive!"
  },
  {
    "joke": "Chuck Norris was the reason why dinosaurs are extinct."
  },
  {
    "joke": "If you knock your drink over at Chuck Norris' house, you will be killed before the drink hits the carpet. Then Norris will catch the glass without spilling a drop anyway."
  },
  {
    "joke": "Viagra takes Chuck Norris."
  },
  {
    "joke": "Chuck Norris doesn't need an OS."
  },
  {
    "joke": "Chuck Norris drank Daniel Day Lewis' milkshake."
  },
  {
    "joke": "Facebook as got a Chuck Norris account"
  },
  {
    "joke": "Chuck Norris practices his roundhouse kicks:  a. Anywhere he wants B. Chuck Norris doesn't need to practice C. On your face D. All of the above  Hint: The answer is 'd'"
  },
  {
    "joke": "Chuck Norris doesn't look at the weather forecast. He DECIDES what the weather will be."
  },
  {
    "joke": "Chuck Norris doesn't eat. He refuels."
  },
  {
    "joke": "Chuck Norris isn't all that interested in astronomy. The only stars Chuck Norris cares about are the 50 on the flag of the USA, the one that's part of his Ranger badge, and the Lone Star of Texas."
  },
  {
    "joke": "Chuck Norris never needs to pay for something, things appear from nothing for him."
  },
  {
    "joke": "The reason they changed it from 10 degrees of seperation to 6 degrees of separation is because Chuck Norris killed the other 4 people that don't know anybody."
  },
  {
    "joke": "9 out of the last 10 women that had sex with Chuck Norris died from lethal injection. The other one died from throbbing penal asphyxiation."
  },
  {
    "joke": "Chuck Norris taught Pai Mei from kill bill 2 the Five Finger Heart Exploding Technique."
  },
  {
    "joke": "Chuck Norris penis can get as hard as granite!"
  },
  {
    "joke": "Chuck Norris Doesnt Sleep..................... He Just Doesnt Sleep"
  },
  {
    "joke": "Bob the Builder. Can we fix it. Chuck Norris already did. With a roundhouse kick."
  },
  {
    "joke": "Chuck Norris's sex position is ... Chuck Fuck!"
  },
  {
    "joke": "Chuck Norris pisses on birds"
  },
  {
    "joke": "The reason Link can't speak is because he got a roundhouse kick in the throat by an unidentified bearded man \"Scientists believe him to be Chuck Norris\""
  },
  {
    "joke": "Chuck Norris can smell how tight your wife is."
  },
  {
    "joke": "Chuck Norris can kick-start a car.Chuck Norris sleeps with a piollw under his gun.Chuck Norris hates Raymond.It took 7 women, 4 doctors, and 3 hospitals to give birth to Chuck Norris.Apple pays Chuck Norris 99cents every time he listens to a song.Chuck Norris can touch MC Hammer.Stephen Hawkings is the only man to have survived an encounter with Chuck Norris.Chuck Norris can hold Puff Daddy down.When Chuck Norris plays monopoly it affects the whole economy."
  },
  {
    "joke": "Chuck Norris wields a freight train like nunchucks."
  },
  {
    "joke": "Chuck Norris can draw cash from ATMs using UNO cards."
  },
  {
    "joke": "Every night, Chuck Norris brings at least three women back to his log cabin in the hills, to give them a good, hard Norrising."
  },
  {
    "joke": "Chuck Norris is in love with bruce lee"
  },
  {
    "joke": "When economic crisis comes, you should know that Chuck Norris is playing Monopoly."
  },
  {
    "joke": "It takes 14 puppeteers to make Chuck Norris smile, but only 2 to make him destroy an orphanage."
  },
  {
    "joke": "Chuck Norris can de-forest 5 acres of the Amazon using a butterknife, a boomerang, and a pair of pliers."
  },
  {
    "joke": "When Chuck Norris opened his mouth he made dodo birds extinct."
  },
  {
    "joke": "\"An apple a day keeps the doctor away\" Chuck Norris can keep the doctor away with a cheeseburger."
  },
  {
    "joke": "Chuck norris has it his way, at McDonalds"
  },
  {
    "joke": "Simon & Garfunkel wrote the lyric 'Hello darkness, my old friend' about the end of several thousand men who saw a Chuck Norris testicle decending to crush their head."
  },
  {
    "joke": "Chuck Norris flicked a booger once from a grassy knoll"
  },
  {
    "joke": "Chuck Norris can literally charm pants off ladies. This of course is useful for his ninesomes."
  },
  {
    "joke": "Chuck Norris's body temperature is 98.6 degrees... Celsius."
  },
  {
    "joke": "Chuck norris my ass ! Chuck Norris is nothing but a lie .. if the things they say is truth he would come here at my pc and bang my head against the key2fg782345fgds89yqw3rq2ajkfsd[0fg9aew91234fsdkag a9r 723qtyr8 aw rfes p98raff"
  },
  {
    "joke": "Never look a gift Chuck Norris in the mouth, because he will bite your damn nose off."
  },
  {
    "joke": "Grizzlys shriek white in terror upon seeing Chuck Norris, today they are a protected species known as Polar Bears."
  },
  {
    "joke": "After Chuck Norris roundhouse kicked Theresa Caputo, the Long Island Medium in the face for being a fake, she really was able to communicate with the dearly departed...posthumously."
  },
  {
    "joke": "Chuck Norris once got a 500 game in bowling. Without a ball. Or pins. Or oxygen. And nobody has ever worked up the courage to ask him how."
  },
  {
    "joke": "Chuck Norris has a reputation not to be sneered at. Seriously, don't sneer at him. You'll get a boot to the kidneys."
  },
  {
    "joke": "Chuck Norris can win a gunfight without firing a shot. And without a gun."
  },
  {
    "joke": "Chuck Norris can sing in a bass voice that makes Barry White and Lou Rawls sound like members of The Chipmunks by comparison."
  },
  {
    "joke": "Chuck Norris is so Right-Wing he plays Pin the Blambe on the Donkey."
  },
  {
    "joke": "The reason Charlie Sheen is winning, is because Chuck Norris isn't playing."
  },
  {
    "joke": "No woman can say no to Chuck Norris, because the only person who can deny Chuck Norris is Chuck Norris."
  },
  {
    "joke": "Chuck Norris is the alpha and the omega. And all those other fruity letters."
  },
  {
    "joke": "Chuck Norris keeps a loaded .357 Magnum down the front of his underpants at all times, and he don't give a fuck."
  },
  {
    "joke": "Chuck Norris demands a 29th day of February every 4 years. We call this leap year. It's true name is leapspinkick year."
  },
  {
    "joke": "There is only one thing that could possibly stop Messi's unstoppable form Chuck Norris's roundhouse kick"
  },
  {
    "joke": "And just who were Rage Against The Machine killing in the name of? Chuck Norris."
  },
  {
    "joke": "upChuck is a term now used to describe how far in the air you fly when Chuck Norris kicks your ass."
  },
  {
    "joke": "Banks don't do public holidays but Chuck Norris does"
  },
  {
    "joke": "As a rule, on weekdays, Chuck Norris eats lunch at Home Depot. That's why his farts smell like rusty roofing nails soaked in turpentine."
  },
  {
    "joke": "Chuck Norris has been all over more co-ed ass than butterfly tattoos."
  },
  {
    "joke": "Chuck Norris was once bitten by a Rattle Snake... After 3 Days of suffering the rattle snake died!"
  },
  {
    "joke": "Chuck Norris once killed a boulder with his bare hands"
  },
  {
    "joke": "Chuck Norris can destroy a falling piano with a dime."
  },
  {
    "joke": "bigfoot doesn't exist, parker just took a picture after Chuck Norris went on a camping trip and moths ate his clothes."
  },
  {
    "joke": "A heckler recently insulted Chuck Norris and made him madder than a castrated moose. It didnt end well for the heckler."
  },
  {
    "joke": "The Grand Canyon is Chuck Norris' toilet."
  },
  {
    "joke": "Chuck Norris once punched a guy so hard he regained consciousness in another zip code."
  },
  {
    "joke": "Jimmy Hoffa owed Chuck Norris money."
  },
  {
    "joke": "Chuck Norris taught Jesus how to grow a beard."
  },
  {
    "joke": "Chuck Norris is the only one that can kill people that can't die!"
  },
  {
    "joke": "Chuck Norris doesn't have nightmares, nightmares have him"
  },
  {
    "joke": "Chuck Norris flosses his teeth with barbed wire."
  },
  {
    "joke": "Chuck Norris overpassed the speed of light."
  },
  {
    "joke": "The reason were greatful for life is because Chuck Norris lets us lie"
  },
  {
    "joke": "Nostradamus didn't predict his spectacular beheading by Chuck Norris"
  },
  {
    "joke": "The Marquis de Sade invented wrought iron testicle clamps. Chuck Norris univented them which is why you've never heard of them before. Chuck Norris prefers to destroy your balls with a roundhouse kick."
  },
  {
    "joke": "Chuck Norris is always ahead of everybody else. But during Daylight Savings Time he is 2 hours ahead."
  },
  {
    "joke": "Chuck Norris knows how to get to Sesame Street"
  },
  {
    "joke": "Once you go Norris, you are physically unable to go back."
  },
  {
    "joke": "If Chuck Norris kicked your ass, then went back in time and kicked your ass again, did he ever kick your ass in the first place?"
  },
  {
    "joke": "Once Chuck Norris pissed off anger, and that is how happyiess was invented."
  },
  {
    "joke": "Chuck Norris doesnt have to have a no solicating sign on his door. he just pee's around the door and sales men know to leave as fast as they can or they will have 5 sec left to live"
  },
  {
    "joke": "Chuck Norris can cough in 7 different languages."
  },
  {
    "joke": "Strange but true: auto tune cannot improve Chuck Norris' voice or farts - he is utterly pitch perfect, or, to be more accurate, pitch perfect is Chuck Norris."
  },
  {
    "joke": "Chuck Norris' beard does not hide his secret smile. It hides another, angrier beard."
  },
  {
    "joke": "Brokeback Mountain isn't just a movie, it's also a pile of dead ninjas in Chuck Norris's backyard."
  },
  {
    "joke": "If Her Royal Highness, Queen Elizabeth of England were to marry Chuck Norris, her official Royal title would be elevated to that of: \"Liz Norris, Chuck's Bitchy Royal Slut of a Wife\"."
  },
  {
    "joke": "Chuck Norris is recommending his friends buy 2 story homes because zombies can't climb stairs."
  },
  {
    "joke": "Chuck Norris can make you piss your soul."
  },
  {
    "joke": "The square root of Chuck Norris is pain. Do not try to square Chuck Norris, the result is death."
  },
  {
    "joke": "Chuck Norris once had a zoo, he said that most of it tasted like chicken."
  },
  {
    "joke": "Chuck Norris can lead a horse to water AND make it drink."
  },
  {
    "joke": "Chuck Norris action figures have been banned in the United States and Mexico due to the roundhouse action related to eye loss in children."
  },
  {
    "joke": "Chuck Norris banned the sale of masks in his likeness, not because of the thousands of heart attacks they cause daily, but because he didn't want random assholes scoring all the pussy clearly meant for him."
  },
  {
    "joke": "Chuck Norris can tear a page out of face book"
  },
  {
    "joke": "\"Smarty Had A Party\" dinnerware was invented because Chuck Norris might show-up."
  },
  {
    "joke": "Colnel Sanders actually died by eleven of Chuck Norris' kicks and punches."
  },
  {
    "joke": "Genesis 32:30- I have seen the face of God Chuck Norris 1:1- I punched the shit out of it"
  },
  {
    "joke": "Jack Kevorkian was a doctor that assisted people in ending their lives voluntarily. His methods were criticized by many. Truth is, he told his patients to close their eyes and he would hold a picture of a Chuck Norris round house kick to their face and have them open their eyes. Indeed they died instantly from the shock and breaking their own necks in fear. When Chuck Norris found out, he round house kicked Kevorkian for copyright infringement."
  },
  {
    "joke": "God rested on the seventh day because Chuck Norris isn't that much of a slave driver."
  },
  {
    "joke": "Chuck Norris once lapped his opponent, in a drag race."
  },
  {
    "joke": "ya know how you cant eat just one lays chip WELL Chuck Norris CAN"
  },
  {
    "joke": "The Dos Equis man once said, \"I am the most interesting man in the world.\" Chuck Norris then said. \"Do you want fries with this\", then bitch slapped him until he cried out for his mommy."
  },
  {
    "joke": "Chuck Norris's spinning back-fist was the inspiration for the centrifuge . They just had to slow it down ."
  },
  {
    "joke": "Chuck Norris has proven we are alone in the universe. We eren't before his first space expidition."
  },
  {
    "joke": "Thanksgiving was not made to thank the indians, it was made to thank Chuck Norris that he didnt kill them when they whizzed on his lawn."
  },
  {
    "joke": "Chuck Norris knows when you have a gerbil up your ass."
  },
  {
    "joke": "Much like a top fuel dragracer, Chuck Norris' penis is equipped with a parachute."
  }
]
